<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="utf-8">
  <meta name="generator" content="pandoc">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
  <title>Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire</title>

  <!--[if lt IE 9]>
    <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
  <![endif]-->
  <link rel="stylesheet" href="css/styles.css" media="all">
  <link rel="stylesheet" href="css/print.css" media="print">
</head>
<body>
<div class="main-header">
	<div class="inside">
		<ul class="skip-links">
			<li><a href="#main">contenu</a></li>
			<li><a href="#navigation">navigation</a></li>
		</ul>
		<header role="banner" class="header  clear" id="banner">
			<h1 class="title">Guide &#171;&#160;Contribuer sur le Web de mani&#232;re accessible&#160;&#187;</h1>
		</header>

		<nav role="navigation" class="gp-sommaire" id="navigation" aria-label="Sommaire du guide">
			<button id="btnSommaire" aria-expanded="false">Sommaire</button>
			<ul class="sommaire is-hidden" id="sommaireToggle">
				<li><a href="index.html">Introduction</a></li>
				<li><a href="images.html">Fiche 1&nbsp;: Quand une image vaut mille mots</a></li>
				<li><a href="couleurs.html">Fiche 2&nbsp;: Les couleurs</a></li>
				<li><a href="cadres.html">Fiche 3&nbsp;: Embarquer des contenus d'autres sites sur ses pages</a></li>
				<li><a href="multimedia.html">Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</a></li>
				<li><a href="tableaux.html">Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></a></li>
				<li><a href="liens.html">Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</a></li>
				<li><a href="titres.html">Fiche 7&nbsp;: Les titres, ou le plan de la page</a></li>
				<li><a href="listes.html">Fiche 8&nbsp;: Listes &#224; puces et listes num&#233;rot&#233;es</a></li>
				<li><a href="langue.html">Fiche 9&nbsp;: Textes multilingues</a></li>
				<li><a href="citations.html">Fiche 10&nbsp;: Citations</a></li>
				<li><a href="mise-en-forme.html">Fiche 11&nbsp;: Mise en forme des textes</a></li>
				<li><a href="docs_telechargement.html">Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</a></li>
				<li><a href="definition.html">Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire</a></li>
				<li><a href="glossaire.html">Glossaire</a></li>
			</ul>
		</nav>
		<div class="github-link">
			<p><a title="Contribuer sur Github" href="https://github.com/DISIC/guide-contribuer_accessible">Contribuer</a>
			<a class="pdfdown" title="Télécharger le guide Contribuer sur le web de manière accessible (pdf, 46ko)" href="http://references.modernisation.gouv.fr/sites/default/files/guide-contribuer-accessible-3.pdf" rel="download">Télécharger</a></p>
		</div>
	</div>
</div>

<div id="wrapper">
	
	<nav role="navigation" class="internav clear">
		<ul>
			<li><a class="prev" href="docs_telechargement.html"><span aria-hidden="true"> &laquo; </span> Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</a></li>
			<li><a class="next" href="glossaire.html">Glossaire <span aria-hidden="true"> &raquo; </span></a></li>
		</ul>
	</nav>	
	<main id="main" role="main">
		<h1 class="fiche-title">Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire</h1>
		<article class="article">
			<p><strong>Toutes les recommandations de cette fiche &#233;tant souvent difficiles &#224; mettre en &#339;uvre, elles ne rel&#232;vent pas du niveau minimum l&#233;gal fran&#231;ais. Il s'agit de recommandations de niveau AAA qui permettent l'acc&#232;s &#224; l'information &#224; certains utilisateurs. Elles restent malgr&#233; cela des recommandations importantes voire indispensables pour l'acc&#232;s &#224; l'information de certains utilisateurs.</strong></p>
		</article>
		<article class="article">
			<h2 id="lenjeu-pour-lutilisateur-handicap&#233;">L'enjeu pour l'utilisateur handicap&#233;</h2>
			<p>Les abr&#233;viations et mots complexes sont une probl&#233;matique qui concernent en priorit&#233; les utilisateurs pr&#233;sentant des d&#233;ficiences cognitives, les utilisateurs qui ont un niveau d'&#233;ducation inf&#233;rieur &#224; la classe de 6<sup>e</sup> ou encore certains utilisateurs sourds qui lisent tr&#232;s peu le langage &#233;crit au profit de la langue des signes.</p>
			<p>Utiliser des termes complexes sans les d&#233;finir, sans fournir d'aide pour en comprendre le sens, employer des expressions figuratives, etc. met en d&#233;faut ces utilisateurs et les emp&#234;che de comprendre les textes et d'acc&#233;der &#224; l'information.</p>
		</article>
		<article class="article">
			<h2 id="en-pratique">En pratique</h2>
			<h3 id="prononciation-des-mots">Prononciation des mots</h3>
			<p>Certains mots ne peuvent pas &#234;tre compris si nous n'en connaissons pas la prononciation. Certains utilisateurs, qui pr&#233;sentent des d&#233;ficiences cognitives ou qui utilisent une synth&#232;se vocale, ont besoin de ces prononciations.</p>
			<p>L'exemple typique est &#160;: &#171;&#160;Les poules du couvent couvent.&#160;&#187;. Une synth&#232;se vocale va lire &#224; l'utilisateur &#171;&#160;Les poules du couve couve&#160;&#187;. Cette phrase est alors incompr&#233;hensible.</p>
			<p>Le plus simple, pour rendre cette prononciation accessible &#224; tous est d'indiquer entre crochets, imm&#233;diatement apr&#232;s le mot concern&#233;, la prononciation du mot : &#171;&#160;Les poules du couvent [couvant] couvent.&#160;&#187;.</p>
		</article>
		<article class="article">
			<h3 id="abr&#233;viations">Abr&#233;viations</h3>
			<p>Souvent les abr&#233;viations ou acronymes ne sont compris que par une partie d'utilisateurs initi&#233;s ou experts du domaine concern&#233;, ou d'un niveau de scolarisation avanc&#233;.</p>
			<p>Pour permettre la compr&#233;hension par tous, vous devez indiquer leur signification sur la premi&#232;re occurrence dans un document. Le plus simple est d'indiquer imm&#233;diatement apr&#232;s l'abr&#233;viation la signification entre parenth&#232;ses. Par exemple : TVA (Taxe sur la valeur ajout&#233;e).</p>
		</article>
		<article class="article">
			<h3 id="jargons-expressions-inhabituelles-expressions-idiomatiques-et-mots-n&#233;cessitant-un-niveau-de-lecture-avanc&#233;e">Jargons, expressions inhabituelles, expressions idiomatiques et mots n&#233;cessitant un niveau de lecture avanc&#233;e</h3>
			<p>Chaque texte qui n&#233;cessite un niveau de lecture plus avanc&#233; que celui de la classe de 6<sup>e</sup> (hors nom propre et titre) doit &#234;tre explicit&#233; &#160;:</p>
			<ul>
			<li>Le mot est illustr&#233; au travers d'une image ou de symboles graphiques adapt&#233;s au niveau de lecture du premier cycle de l'enseignement secondaire.</li>
			<li>Le mot dispose d'une version en langue des signes fran&#231;aise (LSF).</li>
			<li>Le mot dispose d'une version vocalis&#233;e.</li>
			<li>Un r&#233;sum&#233; adapt&#233; est propos&#233; au niveau de lecture de classe de 6<sup>e</sup>.</li>
			</ul>
			<p>De m&#234;me, le jargon, les expressions idiomatiques ou inhabituelles doivent &#234;tre explicit&#233;s&#160;:</p>
			<ul>
			<li>Une d&#233;finition dans le contexte adjacent de l'expression.</li>
			<li>Une d&#233;finition via une liste de d&#233;finition.</li>
			<li>Une d&#233;finition dans la page.</li>
			<li>L'expression est contenue dans un lien permettant d'acc&#233;der &#224; la d&#233;finition.</li>
			</ul>
			<p>Pour des recommandations d'&#233;criture en langage simple, nous vous renvoyons &#224; la m&#233;thode <strong>Facile &#224; lire et &#224; comprendre (FALC)</strong> de l'UNAPEI. Vous pouvez <a href="http://www.adapei66.org/articles-5/78-158-les-3-guides/">trouverez des guides sur le site de l'ADAPEI</a>. La m&#233;thode Facile &#224; lire et &#224; comprendre donne des recommandations pour r&#233;diger et illustrer des textes afin qu'ils soient accessibles aux personnes en situation de handicap mental, psychique ou cognitif.</p>
		</article>
		<article class="article">
			<h3 id="glossaire">Glossaire</h3>
			<p>Pour tous ces termes qui n&#233;cessitent une d&#233;finition, il est &#233;galement possible de mettre en place un glossaire. Ainsi, au lieu d'indiquer les alternatives demand&#233;es directement dans le texte, vous pouvez r&#233;aliser des liens qui m&#232;nent vers leurs explications dans le glossaire. Il est m&#234;me possible d'automatiser en partie ce m&#233;canisme.</p>
			<p>Rapprochez-vous de votre service informatique pour &#233;valuer cette possibilit&#233;.</p>
		</article>
	</main>

	<aside role="complementary" id="footer-block" class="clear">
		<div class="col-1-2">
			<h2 id="voir-ailleurs">Voir ailleurs</h2>
			<ul>
			<li><a href="http://www.adapei66.org/articles-5/78-158-les-3-guides/">Guides pour une r&#233;daction en Facile &#224; lire et &#224; comprendre sur le site de l'ADAPEI</a>&#160;;</li>
			<li>Exemple&#160;: <a href="http://www.social-sante.gouv.fr/actualite-presse,42/discours,2333/facile-a-lire-et-a-comprendre-le,15019.html">le discours de politique g&#233;n&#233;rale du Premier ministre en FALC</a>.</li>
			</ul>
		</div >

		<div class="col-1-2">
			<h2 id="correspondances-rgaa-3.0">Correspondances RGAA 3.0</h2>
			<ul>
			<li>Crit&#232;re 9.4 [AAA]</li>
			<li>Crit&#232;re 9.5 [AAA]</li>
			<li>Crit&#232;re 13.9 [AAA]</li>
			<li>Crit&#232;re 13.10 [AAA]</li>
			<li>Crit&#232;re 13.13 [AAA]</li>
			<li>Crit&#232;re 13.14 [AAA]</li>
			</ul>
		</div>
	</aside>
	
	
	<footer id="footer" role="contentinfo" class="clear">
		<h2>Licence d'utilisation</h2>
		<p class="logo-smgap"><a href="http://references.modernisation.gouv.fr/"><img src="img/modernisation-logo.jpg" alt="Secrétariat général pour le modernisation de l'action publique"></a></p>
		<p>Ce document est la propri&#233;t&#233; du Secr&#233;tariat g&#233;n&#233;ral &#224; la modernisation de l'action publique fran&#231;ais (SGMAP). Il est plac&#233; sous la <a href="https://www.etalab.gouv.fr/licence-ouverte-open-licence">licence ouverte 1.0 ou ult&#233;rieure</a>, &#233;quivalente &#224; une licence <i lang="en">Creative Commons BY</i>. Pour indiquer la paternit&#233;, ajouter un lien vers la version originale du document disponible sur le <a href="https://github.com/DISIC">compte <span lang="en">GitHub</span> de la DInSIC</a>.</p>
		
	</footer>

</div>

<script type="text/javascript" src="js/script.js"></script>
</body>
</html>
