<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="utf-8">
  <meta name="generator" content="pandoc">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
  <title>Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</title>
  <style type="text/css">code{white-space: pre;}</style>
  <!--[if lt IE 9]>
    <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
  <![endif]-->
  <link rel="stylesheet" href="css/styles.css" media="all">
  <link rel="stylesheet" href="css/print.css" media="print">
</head>
<body>
<div class="main-header">
	<div class="inside">
		<ul class="skip-links">
			<li><a href="#main">contenu</a></li>
			<li><a href="#navigation">navigation</a></li>
		</ul>
		<header role="banner" class="header  clear" id="banner">
			<h1 class="title">Guide &#171;&#160;Contribuer sur le Web de mani&#232;re accessible&#160;&#187;</h1>
		</header>

		<nav role="navigation" class="gp-sommaire" id="navigation" aria-label="Sommaire du guide">
			<button id="btnSommaire" aria-expanded="false">Sommaire</button>
			<ul class="sommaire is-hidden" id="sommaireToggle">
				<li><a href="index.html">Introduction</a></li>
				<li><a href="images.html">Fiche 1&nbsp;: Quand une image vaut mille mots</a></li>
				<li><a href="couleurs.html">Fiche 2&nbsp;: Les couleurs</a></li>
				<li><a href="cadres.html">Fiche 3&nbsp;: Embarquer des contenus d'autres sites sur ses pages</a></li>
				<li><a href="multimedia.html">Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</a></li>
				<li><a href="tableaux.html">Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></a></li>
				<li><a href="liens.html">Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</a></li>
				<li><a href="titres.html">Fiche 7&nbsp;: Les titres, ou le plan de la page</a></li>
				<li><a href="listes.html">Fiche 8&nbsp;: Listes &#224; puces et listes num&#233;rot&#233;es</a></li>
				<li><a href="langue.html">Fiche 9&nbsp;: Textes multilingues</a></li>
				<li><a href="citations.html">Fiche 10&nbsp;: Citations</a></li>
				<li><a href="mise-en-forme.html">Fiche 11&nbsp;: Mise en forme des textes</a></li>
				<li><a href="docs_telechargement.html">Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</a></li>
				<li><a href="definition.html">Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire</a></li>
				<li><a href="glossaire.html">Glossaire</a></li>
			</ul>
		</nav>
		<div class="github-link">
			<p><a title="Contribuer sur Github" href="https://github.com/DISIC/guide-contribuer_accessible">Contribuer</a>
			<a class="pdfdown" title="Télécharger le guide Contribuer sur le web de manière accessible (pdf, 848ko)" href="http://references.modernisation.gouv.fr/sites/default/files/guide-contribuer-accessible-3.pdf" download>Télécharger</a></p>
		</div>
	</div>
</div>
<div id="wrapper">
	
	<nav role="navigation" class="internav clear">
		<ul>
			<li><a class="prev" href="mise-en-forme.html"><span aria-hidden="true"> &laquo; </span> Fiche 11&nbsp;: Mise en forme des textes</a></li>
			<li><a class="next" href="definition.html">Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire <span aria-hidden="true"> &raquo; </span></a></li>
		</ul>
	</nav>

	<main id="main" role="main">
		<h1 class="fiche-title">Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</h1>
		<article class="article">
			<h2 id="lenjeu-pour-lutilisateur-handicap&#233;">L'enjeu pour l'utilisateur handicap&#233;</h2>
			<p>L'accessibilit&#233; des documents en t&#233;l&#233;chargement rel&#232;ve des m&#234;mes enjeux que l'accessibilit&#233; d'un contenu web. Vous devez structurer un document avec des titres, des listes, etc. pour permettre aux utilisateurs de pouvoir naviguer et se rep&#233;rer ais&#233;ment dans le document. Toutes les autres probl&#233;matiques s'appliquent &#233;galement&#160;: les couleurs, les descriptions d'image, les tableaux, les liens, etc.</p>
			<p>Les principaux utilisateurs impact&#233;s sont les utilisateurs aveugles, malvoyants ou ayant des difficult&#233;s de lecture.</p>
			<p>Si votre site est accessible, mais que l'information est transmise &#224; vos utilisateurs via des documents bureautiques (.doc, .pdf, etc.) non accessibles, votre contenu n'est pas accessible. Vous emp&#234;chez alors des utilisateurs d'acc&#233;der &#224; cette information.</p>
		</article>
		<article class="article">
			<h2 id="en-pratique-et-en-images">En pratique et en images</h2>
			<p>De mani&#232;re g&#233;n&#233;rale, vous ne devez pas utiliser les documents bureautiques pour v&#233;hiculer une information sp&#233;cifique ou pour cr&#233;er le contenu d'une page. Le contenu principal de votre page doit rester le contenu web et le document bureautique ne doit &#234;tre utilis&#233; qu'&#224; des fins d'impression.</p>
			<h3 id="int&#233;grer-un-document-bureautique-dans-un-site">Int&#233;grer un document bureautique dans un site</h3>
			<p>Lorsque vous mettez un document en t&#233;l&#233;chargement, vous devez informer l'utilisateur du <strong>poids et du format</strong> de ce document.</p>
			<p>Cette information permet &#224; l'utilisateur de comprendre qu'il s'agit d'un document &#224; t&#233;l&#233;charger, d'en conna&#238;tre ses caract&#233;ristiques et lui permet donc d'&#233;valuer si oui ou non il va t&#233;l&#233;charger le document. Concernant le format d'un document, l'information est importante pour un utilisateur pour savoir s'il sera capable de l'ouvrir (n&#233;cessit&#233; d'un logiciel particulier par exemple), et s'il sera capable de le parcourir (compatibilit&#233; du format avec les technologies d'assistance).</p>
			<p>Lorsque vous int&#233;grez un document en t&#233;l&#233;chargement, vous cr&#233;ez un lien dans votre texte. Vous devez sp&#233;cifier dans le contexte du lien, le mieux &#233;tant dans l'intitul&#233; ou le titre du lien, le format et le poids de ce document. Par exemple&#160;: &#171;&#160;Guide d'accompagnement RGAA 3.0 (pdf, 240 ko)&#160;&#187;.</p>
			<p><em>Nous vous renvoyons vers la <a href="liens.html">fiche 6&#160;: Cr&#233;er du lien sans perdre son chemin</a> pour la cr&#233;ation d'intitul&#233; et de titre de liens.</em></p>
			<p>Ci-dessous un exemple d'utilisation du titre de lien dans l'&#233;diteur de texte de <span lang="en">Wordpress</span> pour la d&#233;finition du poids et format d'un document &#224; t&#233;l&#233;charger.</p>
			<img src="img/bureautique/poids-format.png" alt="" />
			<p><strong>Note&#160;: le d&#233;veloppeur de votre site a pu mettre en place une fonctionnalit&#233; qui d&#233;tecte automatiquement les informations de poids et format et les int&#232;gre directement dans le titre du lien de t&#233;l&#233;chargement. Renseignez-vous aupr&#232;s de votre service informatique sur l'existence de cette fonctionnalit&#233;.</strong></p>
		</article>
		<article class="article">
			<h4 id="solutions-pour-des-documents-non-accessibles">Solutions pour des documents non accessibles</h4>
			<ul>
				<li>Si votre document n'est pas accessible, <strong>pr&#233;venez l'utilisateur</strong>. Comme pour le poids et le format, indiquez dans l'intitul&#233; ou titre de lien, que le document n'est pas accessible.</li>
			<li><p>Vous pouvez aussi <strong>mettre &#224; disposition un document &#233;quivalent accessible</strong> dans un autre format.</p>
					<p>Par exemple, vous avez un document au format PDF mis en forme dans un logiciel qui ne permet pas de g&#233;rer l'accessibilit&#233; (par exemple, le bulletin municipal mis en forme dans un logiciel de PAO qui ne permet pas de g&#233;rer l'accessibilit&#233;). Ce document n'est pas structur&#233; et vous ne pouvez pas agir dessus. Par contre, vous pouvez recr&#233;er un &#233;quivalent accessible dans un autre format (dans un logiciel de traitement de texte au format .doc, .odt, etc.) et le mettre en t&#233;l&#233;chargement &#233;galement.</p>
			<p>Ainsi, vous pouvez proposer, pour un m&#234;me contenu, 2 documents (un accessible et un non accessible), en explicitant dans leur intitul&#233; ou titre de lien, lequel est accessible et lequel ne l'est pas.</p>
			</li>
			<li><p><strong>Cr&#233;er une page web structur&#233;e</strong> o&#249; transposer le contenu d'un document en t&#233;l&#233;chargement non accessible.</p>
			<p>Il s'agit simplement de cr&#233;er une page d&#233;di&#233;e qui reprenne le contenu de ce document. Ainsi, l'alternative accessible n'est plus un autre document &#224; t&#233;l&#233;charger mais une page de votre site web &#224; visiter. De m&#234;me que pour la mise &#224; disposition de 2 documents &#224; t&#233;l&#233;charger, vous pouvez alors mettre un lien vers la page qui contient le contenu accessible de ce document en sp&#233;cifiant qu'il s'agit de la version accessible.</p>
			<p><strong>Note&#160;:</strong> Privil&#233;giez cette option lorsque c'est possible.</p></li>
			</ul>
		</article>
	</main>

	<aside role="complementary" id="footer-block" class="clear">
		<div class="col-1-2">
			<h2 id="voir-ailleurs...">Voir ailleurs...</h2>
			<ul>
			<li><a href="http://www.microsoft.com/fr-fr/download/details.aspx?id=23856">Cr&#233;er des documents accessibles avec Microsoft Office Word 2010</a>&#160;;</li>
			<li><a href="http://www.microsoft.com/fr-fr/download/details.aspx?id=8908">Cr&#233;er des documents accessibles avec Microsoft Office Word 2007</a>&#160;;</li>
			<li><a href="http://extensions.libreoffice.org/extension-center/accessodf">AccessODF - Extension d'accessibilit&#233; pour les logiciels OpenOffice et LibreOffice</a>&#160;;</li>
			<li><a href="http://www.digitalgov.gov/2015/07/23/pdfs-a-digital-content-detour/">PDFs: <i lang="en">A Digital Content Detour</i> - Un article sur les probl&#232;mes d'accessibilit&#233; des documents PDF (ressource en anglais)</a>.</li>
			</ul>
		</div>

		<div class="col-1-2">
			
			<h2 id="correspondances-rgaa-3.0">Correspondances RGAA 3</h2>
			<ul>
			<li>Crit&#232;re 13.6 [A]</li>
			<li>Crit&#232;re 13.7 [A]</li>
			</ul>
		</div>
	</aside>
	
	
	<footer id="footer" role="contentinfo" class="clear">
		<h2>Licence d'utilisation</h2>
		<p class="logo-smgap"><a href="http://references.modernisation.gouv.fr/"><img src="img/modernisation-logo.jpg" alt="Secrétariat général pour le modernisation de l'action publique"></a></p>
		<p>Ce document est la propri&#233;t&#233; du Secr&#233;tariat g&#233;n&#233;ral &#224; la modernisation de l'action publique fran&#231;ais (SGMAP). Il est plac&#233; sous la <a href="https://www.etalab.gouv.fr/licence-ouverte-open-licence">licence ouverte 1.0 ou ult&#233;rieure</a>, &#233;quivalente &#224; une licence <i lang="en">Creative Commons BY</i>. Pour indiquer la paternit&#233;, ajouter un lien vers la version originale du document disponible sur le <a href="https://github.com/DISIC">compte <span lang="en">GitHub</span> de la DInSIC</a>.</p>
		
	</footer>

</div>
<script type="text/javascript" src="js/script.js"></script>
</body>
</html>
