<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="utf-8">
  <meta name="generator" content="pandoc">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
  <title>Fiche 1&#160;: Quand une image vaut mille mots...</title>
  <!--[if lt IE 9]>
    <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
  <![endif]-->
  <link rel="stylesheet" href="css/styles.css" media="all">
  <link rel="stylesheet" href="css/print.css" media="print">
</head>
<body>

<div class="main-header">
	<div class="inside">
		<ul class="skip-links">
			<li><a href="#main">contenu</a></li>
			<li><a href="#navigation">navigation</a></li>
		</ul>
		<header role="banner" class="header  clear" id="banner">
			<h1 class="title">Guide &#171;&#160;Contribuer sur le Web de mani&#232;re accessible&#160;&#187;</h1>
		</header>
		<nav role="navigation" class="gp-sommaire" aria-label="Sommaire du guide" id="navigation">
			<button id="btnSommaire" aria-expanded="false">Sommaire</button>
			<ul class="sommaire is-hidden" id="sommaireToggle">
				<li><a href="index.html">Introduction</a></li>
				<li><a href="images.html">Fiche 1&nbsp;: Quand une image vaut mille mots</a></li>
				<li><a href="couleurs.html">Fiche 2&nbsp;: Les couleurs</a></li>
				<li><a href="cadres.html">Fiche 3&nbsp;: Embarquer des contenus d'autres sites sur ses pages</a></li>
				<li><a href="multimedia.html">Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</a></li>
				<li><a href="tableaux.html">Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></a></li>
				<li><a href="liens.html">Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</a></li>
				<li><a href="titres.html">Fiche 7&nbsp;: Les titres, ou le plan de la page</a></li>
				<li><a href="listes.html">Fiche 8&nbsp;: Listes &#224; puces et listes num&#233;rot&#233;es</a></li>
				<li><a href="langue.html">Fiche 9&nbsp;: Textes multilingues</a></li>
				<li><a href="citations.html">Fiche 10&nbsp;: Citations</a></li>
				<li><a href="mise-en-forme.html">Fiche 11&nbsp;: Mise en forme des textes</a></li>
				<li><a href="docs_telechargement.html">Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</a></li>
				<li><a href="definition.html">Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire</a></li>
				<li><a href="glossaire.html">Glossaire</a></li>
			</ul>
		</nav>
		<div class="github-link">
			<p><a title="Contribuer sur Github" href="https://github.com/DISIC/guide-contribuer_accessible">Contribuer</a>
			<a class="pdfdown" title="Télécharger le guide Contribuer sur le web de manière accessible (pdf, 46ko)" href="http://references.modernisation.gouv.fr/sites/default/files/guide-contribuer-accessible-3.pdf" rel="download">Télécharger</a></p>
		</div>
	</div>
</div>

<div id="wrapper">
	<nav role="navigation" class="internav clear">
		<ul>
			<li><a class="prev" href="index.html"><span aria-hidden="true"> &laquo; </span> Introduction</a></li>
			<li><a class="next" href="couleurs.html">Fiche 2&nbsp;: Les couleurs <span aria-hidden="true"> &raquo; </span></a></li>
		</ul>
	</nav>	

	
	<main id="main" role="main">
		<h1 class="fiche-title">Fiche 1&#160;: Quand une image vaut mille mots...</h1>
	<article class="article">
		<p>On distingue deux types d'images&#160;:</p>
		<ul>
			<li>les images porteuses d'informations (qui ont besoin d'un texte de remplacement)&#160;;</li>
			<li>les images de d&#233;coration (qui ne doivent pas avoir de texte de remplacement).</li>
		</ul>
	</article>
	<article class="enjeu article">
		<h2 id="lenjeu-pour-lutilisateur-handicap&#233;" class="enjeu">L'enjeu pour l'utilisateur handicap&#233;</h2>
		<p>Les images v&#233;hiculent parfois une information non textuelle. Cette information, qui peut aider &#224; comprendre le contenu auquel elle se rapporte, doit pouvoir &#234;tre accessible &#224; tous.</p>
		<p>Fournir une alternative est indispensable pour les utilisateurs qui ne perçoivent pas, ou perçoivent mal, le contenu visuel. C'est le cas des personnes aveugles ou malvoyantes. Un <a href="glossaire.html#lecteur-decran">lecteur d'&#233;cran</a> va pouvoir acc&#233;der &#224; cette alternative et le restituer &#224; l'utilisateur.</p>
		<p>De m&#234;me, pour les personnes qui pr&#233;sentent des difficult&#233;s de compr&#233;hension face &#224; certaines repr&#233;sentations visuelles, (iconographie, peintures, repr&#233;sentations multi-dimensionnelles, graphiques ...), une alternative peut aider &#224; en comprendre le sens ou &#224; en extraire l'information importante.</p>
		<p>Pour toutes ces raisons, il est essentiel de traduire de mani&#232;re textuelle l'information n&#233;cessaire et suffisante qu'apportent les images.</p>
		<p>Lorsque ces images constituent des liens, ce n'est alors plus l'information qu'elles v&#233;hiculent qui est essentielle, mais la fonction du lien qu'elles constituent. Dans cette situation, elles permettent aux logiciels pilot&#233;s &#224; la voix par une personne en situation de handicap moteur, de localiser plus facilement le lien &#224; activer.</p>
	</article>
	<article class="article">
		<h2 id="en-pratique-et-en-images">En pratique et en images</h2>
		<p>Lorsque l'information &#224; traduire est courte, vous allez utiliser le texte de remplacement.</p>
		<p>Dans votre &#233;diteur de texte, vous devez &#233;diter les propri&#233;t&#233;s de l'image pour acc&#233;der &#224; ce texte de remplacement. G&#233;n&#233;ralement, l'ajout d'une image ou l'&#233;dition de ses propri&#233;t&#233;s sont accessibles par un bouton repr&#233;sentant une petite image&#160;: <img class="inline-img" src="img/images/icone-image.png" alt="" /></p>
		<p>Ci-dessous, un exemple de fen&#234;tre des propri&#233;t&#233;s de l'image, dans l'&#233;diteur CKEditor, avec un texte de remplacement.</p>
		<p><img src="img/images/ckeditor.png" alt="Renseignez un texte de remplacement dans CKEditor" /></p>
		<p>Ci-dessous, un exemple de fen&#234;tre des propri&#233;t&#233;s de l'image dans l'&#233;diteur de texte de <span lang="en">Wordpress</span>, avec un texte de remplacement.</p>
		<p><img src="img/images/wordpress.png" alt="Renseignez un texte de remplacement dans Wordpress" /></p>
		<p>Selon l'&#233;diteur de texte que vous avez &#224; votre disposition, le champ correspondant au texte de remplacement d'une image peut-&#234;tre d&#233;sign&#233; par&#160;:</p>
		<ul>
			<li><i lang="en">Alt Text</i>&#160;;</li>
			<li><i lang="en">Alternative Text</i>&#160;;</li>
			<li>Texte alternatif&#160;;</li>
			<li>Texte de remplacement.</li>
		</ul>
		<p>Le texte de remplacement (ou alternative textuelle) d'une image est un texte pr&#233;sent avec l'image dans le code de la page, vous ne le voyez pas lorsque vous consultez le site. Cette information est accessible &#224; un <a href="glossaire.html#lecteur-decran">lecteur d'&#233;cran</a>, et certaines autres personnes peuvent demander son affichage &#224; la place de l'image.</p>
		<p>Vous pouvez rencontrer diff&#233;rents cas de repr&#233;sentation.</p>
	</article>
	<article class="article">
		<h3 id="des-images-qui-contiennent-du-texte-en-image.">Des images qui contiennent du texte en image.</h3>
		<p>Dans ces cas, le texte de remplacement est g&#233;n&#233;ralement le texte pr&#233;sent sur l'image. Par contre, si ce texte se retrouve dans le contenu qu'elle accompagne, alors cette image est une image de d&#233;coration et ne doit pas avoir d'alternative. Par exemple, vous &#233;crivez un article sur une manifestation &#224; venir en indiquant la date et le lieu, et l'image repr&#233;sente l'affiche de la manifestation sur laquelle on peut lire le lieu et la date. Dans ce cas cette image n'apporte pas d'information suppl&#233;mentaire. Lui mettre un texte de remplacement serait redondant.</p>
		<img src="img/images/image-redondant.png" alt="" />
		<p>Dans l'exemple ci-dessus, l'image contient les informations suivantes&#160;:</p>
		<ul>
		<li>Le nom de la manifestation &#171;&#160;Semaine de l'innovation publique&#160;&#187;, qui est &#233;galement le titre du contenu associ&#233;&#160;;</li>
		<li>La date, du 12 au 18 octobre 2015, que l'on retrouve en texte dans l'introduction du contenu associ&#233;&#160;;</li>
		<li>Un texte &#171;&#160;La France fait bouger ses services publics&#160;&#187; et &#171;&#160;participez&#160;&#187;. Ces deux informations bien que ne se retrouvant pas &#171;&#160;textuellement&quot; dans le texte associ&#233;, sont des id&#233;es reprises et d&#233;velopp&#233;es dans le contenu.</li>
		</ul>
	</article>
	<article class="article">
		<h3 id="des-images-qui-repr&#233;sentent-une-sc&#232;ne-ou-une-action-un-graphique-une-carte-ou-un-sch&#233;ma.">Des images qui repr&#233;sentent une sc&#232;ne ou une action, un graphique, une carte ou un sch&#233;ma.</h3>
		<p>Dans ces cas, si l'information est essentielle &#224; la compr&#233;hension, vous devez la d&#233;crire dans le texte de remplacement. Il est important de retenir qu'il ne faut pas d&#233;crire n&#233;cessairement en d&#233;tails les images. Vous devez fournir l'information <strong>suffisante et n&#233;cessaire</strong>.</p>
		<h3 id="infobulle-des-images">Infobulle des images</h3>
		<p>Dans certains &#233;diteurs, vous avez &#233;galement la possibilit&#233; de d&#233;finir une <strong>infobulle</strong> sur les images. Une infobulle est une information qui appara&#238;t au survol de l'image. Elle est d&#233;sign&#233;e par les termes infobulles, titre ou encore <i lang="en">title</i> selon l'&#233;diteur de texte. Cette infobulle ne doit jamais se substituer au texte de remplacement. Vous pouvez le renseigner, &#224; la seule condition que le texte que vous y inscrivez soit <strong>identique</strong> au texte de remplacement. Cette infobulle peut-&#234;tre utile dans le cas d'une image qui est de mauvaise qualit&#233; par exemple, qui contient du texte et pourrait poser probl&#232;me &#224; des personnes ayant des d&#233;ficiences visuelles.</p>
		<p>
		Ci-dessous, un exemple de fen&#234;tre des propri&#233;t&#233;s de l'image dans l'&#233;diteur de texte de <span lang="en">Wordpress</span>, avec un texte de remplacement et une infobulle renseign&#233;s.
		</p>

		<img src="img/images/title-wordpress.png" alt="" />
	</article>
	<article class="article">
		<h3 id="cas-des-images-complexes-la-description-d&#233;taill&#233;e">Cas des images complexes&#160;: la description d&#233;taill&#233;e</h3>
		<p>Le texte de remplacement n'est &#224; utiliser que dans le cas d'images qu'il est simple de d&#233;crire en une phrase. Dans le cas d'une image complexe, qui demande la r&#233;daction d'un paragraphe entier (par exemple un plan de quartier, un graphique, un histogramme), vous devez fournir une description d&#233;taill&#233;e.</p>
		<p>Lorsqu'une image demande une description d&#233;taill&#233;e, vous allez r&#233;diger, sous cette image, un paragraphe. C'est le cas des images complexes comme un graphique de donn&#233;es ou une infographie.</p>
		<p>Pour permettre &#224; un utilisateur de <a href="glossaire.html#lecteur-decran">lecteur d'&#233;cran</a> de faire le lien entre votre image et sa description d&#233;taill&#233;e, vous allez proc&#233;der de la mani&#232;re suivante&#160;:</p>
		<ul>
		<li>Dans le champ qui permet de d&#233;finir un texte de remplacement, vous titrez votre image sans la d&#233;crire, en indiquant qu'il existe une description. Par exemple&#160;: plan d'acc&#232;s (voir description ci-apr&#232;s)&#160;;</li>
		<li>Au d&#233;but de votre description d&#233;taill&#233;e, vous allez reprendre ce titre. Par exemple&#160;: <i>&#171;&#160;Plan d'acc&#232;s (description d&#233;taill&#233;e)&#160;: Pour acc&#233;der &#224;&#8230;&#160;&#187;</i>.</li>
		</ul>
		<p>Il est important de noter, que <strong>votre description d&#233;taill&#233;e doit &#234;tre correctement structur&#233;e</strong>. Par exemple, dans le cas d'un graphique complexe, une description d&#233;taill&#233;e pourrait reprendre l'information sous la forme d'un tableau ou d'une liste. Une description d&#233;taill&#233;e n'est pas n&#233;cessairement un paragraphe simplement, c'est &#224; vous de juger de la meilleure structuration possible pour restituer l'information. Consultez les fiches concern&#233;es pour en savoir plus.</p>
		<h4 id="exemple-dune-image-complexe-avec-une-description-d&#233;taill&#233;e">Exemple d'une image complexe avec une description d&#233;taill&#233;e</h4>
		<p>Ci-dessous l'exemple d'une image complexe. Il s'agit d'un plan de localisation. Un texte de remplacement n'est pas suffisant pour retranscrire toute l'information pr&#233;sente sur ce plan.</p>
		<div class="note clear">
			<div class="col-1-2">
				<p><img src="img/images/image-complexe.png" alt="Plan d'acc&#232;s au Mus&#233;e d'histoire naturelle" /></p>
			</div>
			<div class="col-1-2">
				<h5 id="description-d&#233;taill&#233;e-du-plan-dacc&#232;s-au-mus&#233;e-dhistoire-naturelle">Description d&#233;taill&#233;e du plan d'acc&#232;s au mus&#233;e d'histoire naturelle</h5>
				<p>L'entr&#233;e du mus&#233;e d'histoire naturelle est accessible depuis la rue Voltaire.</p>
				<p>Depuis la rue Ath&#233;nas, descendre vers la rue Voltaire et prendre sur la gauche, l'entr&#233;e du mus&#233;e est situ&#233;e sur votre gauche.</p>
				<p>Depuis la rue Lesage, descendre vers la rue Voltaire et prendre sur la droite, l'entr&#233;e du mus&#233;e est situ&#233;e sur votre droite.</p>
				<p>Depuis la Rue Marivaux, redescendre vers la rue Lesage, continuer tout droit pour atteindre la rue Voltaire, l'entr&#233;e du mus&#233;e est situ&#233;e sur votre droite.</p>
			</div>
		</div>
	</article>
	<article class="article memo">
		<h2 id="m&#233;mo-pour-agir">M&#233;mo pour agir</h2>
		<ul>
		<li>Si je supprime cette image, puis-je comprendre le texte qui est autour sans perdre d'information&#160;?</li>
		<li>Le texte de remplacement de cette image est-il suffisant et apporte-t-il la m&#234;me information que l'image&#160;?</li>
		</ul>	
	</article>
	
	<article class="article idees">
		<h2 id="id&#233;es-re&#231;ues">Id&#233;es re&#231;ues</h2>
		<h3 id="halte-aux-abus-pour-r&#233;f&#233;rencement">Halte aux abus pour r&#233;f&#233;rencement</h3>
		<p>C'est un frein &#224; l'accessibilit&#233; que d'utiliser la fonction permettant de renseigner un texte de remplacement &#224; l'image, on une infobulle, pour y ins&#233;rer des mots cl&#233;s ou phrases pour am&#233;liorer un r&#233;f&#233;rencement.</p>
		<p>En effet, un utilisateur de <a href="glossaire.html#lecteur-decran">lecteur d'&#233;cran</a> se verra restituer toutes ces informations. L'exp&#233;rience de lecture sera alors surcharg&#233;e d'&#233;l&#233;ments parasites et rendra incompr&#233;hensible le contenu du site.</p>
		<h3 id="une-image-peut-avoir-une-alternative-vide">Une image peut avoir une alternative vide</h3>
		<p>Toutes les images n'ont pas besoin d'un texte de remplacement. Si l'image est une d&#233;coration (elle n'apporte aucune information essentielle au contenu), elle ne doit pas avoir de texte de remplacement. Pour la m&#234;me raison qu'&#233;voqu&#233;e au-dessus, cela alourdit la restitution du contenu pour un utilisateur de <a href="glossaire.html#lecteur-decran">lecteur d'&#233;cran</a>, pour un gain en information nul.</p>
		<h3 id="lalternative-de-limage-ne-doit-pas-&#234;tre-utilis&#233;e-pour-mentionner-les-cr&#233;dits-auteur-date-etc...-de-limage">L'alternative de l'image ne doit pas &#234;tre utilis&#233;e pour mentionner les cr&#233;dits (auteur, date etc...) de l'image</h3>
		<p>Si vous cr&#233;ditez une image, vous ne devez pas utiliser le texte de remplacement de l'image. Tout d'abord, cela signifie que tout le monde n'a pas acc&#232;s &#224; cette information. Ensuite, le texte de remplacement sert &#224; d&#233;crire l'image, et non pas &#224; l'attribuer. Dans le cas pr&#233;cis des cr&#233;dits, la m&#233;thode d&#233;crite dans la description d&#233;taill&#233;e est tout &#224; fait appropri&#233;e.</p>
	</article>
	</main>

	<aside role="complementary" id="footer-block" class="clear">
		<div class="col-1-2">
			<h2 id="voir-aussi...">Voir aussi...</h2>
			<ul>
			<li>Quand une image est aussi un lien, la fonction de lien l'emporte sur la nature de l'image. Voir la <a href="liens.html">fiche 6&#160;: Cr&#233;er du lien sans perdre son chemin</a>&#160;;</li>
			<li>Attention aux contrastes et &#224; l'information v&#233;hicul&#233;e par la couleur. Voir la <a href="#couleurs.html">fiche 2&#160;: Les couleurs</a>.</li>
			</ul>
			<h2 id="voir-ailleurs">Voir ailleurs</h2>
			<ul>
			<li><a href="http://ics.utc.fr/capa/DOCS/SP4/Tuto/02/co/02-CAPA_BonnesPratiques_3.html">Bonnes pratiques pour l'accessibilit&#233; des images (Sur le site de l'Unit&#233; ing&#233;nierie des contenus et savoirs)</a></li>
			<li><a href="http://ics.utc.fr/capa/DOCS/SP4/Tuto/01/co/01-CAPA_Sensibilisation_3.html">Exemples et contre exemples d'accessibilit&#233; des images (Sur le site de l'Unit&#233; ing&#233;nierie des contenus et savoirs)</a></li>
			</ul>
		</div>

		<div class="col-1-2">
			<h2 id="correspondances-rgaa-3.0">Correspondances RGAA 3.0</h2>
			<ul class="corress">
				<li>Crit&#232;re 1.2 [A]</li>
				<li>Crit&#232;re 1.3 [A]</li>
				<li>Crit&#232;re 1.6 [A]</li>
				<li>Crit&#232;re 1.7 [A]</li>
				<li>Crit&#232;re 1.10 [A]</li>
			</ul>
		</div>
	</aside>
	
	
	<footer id="footer" role="contentinfo" class="clear">
		<h2>Licence d'utilisation</h2>
		<p class="logo-smgap"><a href="http://references.modernisation.gouv.fr/"><img src="img/modernisation-logo.jpg" alt="Secrétariat général pour le modernisation de l'action publique"></a></p>
		<p>Ce document est la propri&#233;t&#233; du Secr&#233;tariat g&#233;n&#233;ral &#224; la modernisation de l'action publique fran&#231;ais (SGMAP). Il est plac&#233; sous la <a href="https://www.etalab.gouv.fr/licence-ouverte-open-licence">licence ouverte 1.0 ou ult&#233;rieure</a>, &#233;quivalente &#224; une licence <i lang="en">Creative Commons BY</i>. Pour indiquer la paternit&#233;, ajouter un lien vers la version originale du document disponible sur le <a href="https://github.com/DISIC">compte <span lang="en">GitHub</span> de la DInSIC</a>.</p>
		
	</footer>

</div>
<script type="text/javascript" src="js/script.js"></script>
</body>
</html>
