<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="utf-8">
  <meta name="generator" content="pandoc">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
  <title>Fiche 11&nbsp;: Mise en forme des textes</title>
  <!--[if lt IE 9]>
    <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
  <![endif]-->
  <link rel="stylesheet" href="css/styles.css" media="all">
  <link rel="stylesheet" href="css/print.css" media="print">
</head>
<body>
<div class="main-header">
	<div class="inside">
		<ul class="skip-links">
			<li><a href="#main">contenu</a></li>
			<li><a href="#navigation">navigation</a></li>
		</ul>
		<header role="banner" class="header  clear" id="banner">
			<h1 class="title">Guide &#171;&#160;Contribuer sur le Web de mani&#232;re accessible&#160;&#187;</h1>
		</header>

		<nav role="navigation" class="gp-sommaire" id="navigation" aria-label="Sommaire du guide">
			<button id="btnSommaire" aria-expanded="false">Sommaire</button>
			<ul class="sommaire is-hidden" id="sommaireToggle">
				<li><a href="index.html">Introduction</a></li>
				<li><a href="images.html">Fiche 1&nbsp;: Quand une image vaut mille mots</a></li>
				<li><a href="couleurs.html">Fiche 2&nbsp;: Les couleurs</a></li>
				<li><a href="cadres.html">Fiche 3&nbsp;: Embarquer des contenus d'autres sites sur ses pages</a></li>
				<li><a href="multimedia.html">Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</a></li>
				<li><a href="tableaux.html">Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></a></li>
				<li><a href="liens.html">Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</a></li>
				<li><a href="titres.html">Fiche 7&nbsp;: Les titres, ou le plan de la page</a></li>
				<li><a href="listes.html">Fiche 8&nbsp;: Listes &#224; puces et listes num&#233;rot&#233;es</a></li>
				<li><a href="langue.html">Fiche 9&nbsp;: Textes multilingues</a></li>
				<li><a href="citations.html">Fiche 10&nbsp;: Citations</a></li>
				<li><a href="mise-en-forme.html">Fiche 11&nbsp;: Mise en forme des textes</a></li>
				<li><a href="docs_telechargement.html">Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</a></li>
				<li><a href="definition.html">Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire</a></li>
				<li><a href="glossaire.html">Glossaire</a></li>
			</ul>
		</nav>
		<div class="github-link">
			<p><a title="Contribuer sur Github" href="https://github.com/DISIC/guide-contribuer_accessible">Contribuer</a>
			<a class="pdfdown" title="Télécharger le guide Contribuer sur le web de manière accessible (pdf, 848ko)" href="http://references.modernisation.gouv.fr/sites/default/files/guide-contribuer-accessible-3.pdf" download>Télécharger</a></p>
		</div>
	</div>
</div>

<div id="wrapper">
	
	<nav role="navigation" class="internav clear">
		<ul>
			<li><a class="prev" href="citations.html"><span aria-hidden="true"> &laquo; </span> Fiche 10&nbsp;: Citations</a></li>
			<li><a class="next" href="docs_telechargement.html">Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement <span aria-hidden="true"> &raquo; </span></a></li>
		</ul>
	</nav>

	<main id="main" role="main">
		<h1 class="fiche-title">Fiche 11&nbsp;: Mise en forme des textes</h1>
		<article class="article">
			<p><strong>Toutes les recommandations de cette fiche &#233;tant souvent difficiles &#224; mettre en &#339;uvre, elles ne rel&#232;vent pas du niveau minimum l&#233;gal fran&#231;ais. Il s'agit de recommandations de niveau AAA qui permettent l'acc&#232;s &#224; l'information &#224; certains utilisateurs. Elles restent malgr&#233; cela des recommandations importantes, voire indispensables, pour l'acc&#232;s &#224; l'information de certains utilisateurs.</strong></p>
		</article>
		<article class="article">
			<p>Sur le web, il faut bien <strong>distinguer le fond et la forme</strong>.</p>
			<p>Le fond rassemble le contenu, les informations que vous ajoutez en tant que contributeur. Il s'agit principalement de texte et d'images.</p>
			<p>La forme concerne tout ce qui concerne les couleurs des textes, la taille des caract&#232;res et toutes les autres propri&#233;t&#233;s de texte, les positionnements des &#233;l&#233;ments&#8230; La forme est r&#233;alis&#233;e par le d&#233;veloppeur qui &#233;crit une feuille de style qui s'applique aux &#233;l&#233;ments de la page.</p>
			<p>Vous ne devez pas modifier ces propri&#233;t&#233;s, notamment les propri&#233;t&#233;s de texte, gr&#226;ce aux &#233;diteurs de texte via lesquels vous ins&#233;rez du contenu. En effet, ces styles ont &#233;t&#233; con&#231;us et r&#233;fl&#233;chis (couleur, interlignage etc.) pour l'accessibilit&#233;. Si vous les modifiez sans en conna&#238;tre les impacts, il peut en r&#233;sulter un d&#233;faut d'accessibilit&#233;.</p>

		</article>
		<article class="article">
			<h2 id="lenjeu-pour-lutilisateur-handicap&#233;">L'enjeu pour l'utilisateur handicap&#233;</h2>
			<p>La mise en forme des textes est une probl&#233;matique qui touche principalement les personnes ayant des troubles cognitifs (dyslexiques par exemple).</p>
			<p>Par exemple, un interlignage trop r&#233;tr&#233;ci est une difficult&#233; suppl&#233;mentaire pour ces utilisateurs. De m&#234;me qu'une police fantaisiste, difficile &#224; d&#233;chiffrer. En effet, certains utilisateurs ayant des difficult&#233;s de d&#233;codage (dyslexiques notamment), ont besoin d'avoir un texte calibr&#233; d'une certaine mani&#232;re, afin de ne pas encombrer la compr&#233;hension. Une mise en forme qui ne respecte pas certains standards demande un effort suppl&#233;mentaire &#224; ces utilisateurs pour d&#233;coder, au d&#233;triment de la compr&#233;hension.</p>
			<p>Sachez &#233;galement, que les recommandations qui suivent peuvent &#234;tre atteintes en mettant en place des syst&#232;mes de configuration &#224; disposition des utilisateurs. Par exemple, vous pouvez proposer un bouton sur votre site qui permettra de retirer toutes les justifications de texte, ou un bouton pour augmenter les interlignages. Rapprochez-vous du d&#233;veloppeur de votre site pour en savoir davantage sur ces m&#233;canismes de personnalisation.</p>
		</article>
		<article class="article">
			<h2 id="en-pratique-et-en-images">En pratique et en images</h2>
			<h3 id="texte-justifi&#233;">Texte justifi&#233;</h3>
			<p>Afin de conserver un espacement entre les mots qui reste constant il est recommand&#233; de ne pas utiliser de texte justifi&#233;. En effet, justifier un texte va recalculer tous les espacement entre les mots, rendre ces espacements diff&#233;rents &#224; chaque fois, et perturber la lecture et la compr&#233;hension des utilisateurs qui pr&#233;sentent des troubles de la lecture. Pour ces utilisateurs, il est pr&#233;f&#233;rable de conserver un espacement constant.</p>
			<p>Dans la plupart des &#233;diteurs de texte riche, vous avez plusieurs boutons qui vous permettent de configurer l'alignement des textes&#160;:</p>
			<ul>
			<li>un bouton permettant d'aligner le texte &#224; gauche (et un autre &#224; droite), <br />g&#233;n&#233;ralement symbolis&#233;e par cette ic&#244;ne <img class="inline-img" src="img/mise-en-forme/btn-gauche.png" alt="" />&#160;;</li>
			<li>un bouton permettant de justifier un texte,<br />g&#233;n&#233;ralement symbolis&#233;e par cette ic&#244;ne <img src="img/mise-en-forme/btn-justifie.png" class="inline-img" alt="" />.</li>
			</ul>
			<p>Ci dessous, un exemple d'alignement de texte &#224; gauche dans l'&#233;diteur de <span lang="en">Wordpress</span></p>
			<img src="img/mise-en-forme/texte-justifie.png" alt="" />
			<p>Parfois, l'alignement des textes est d&#233;fini par le d&#233;veloppeur, dans la feuille de style g&#233;n&#233;rale du site que vous ne pouvez pas modifier. Vos modifications d'alignement dans l'&#233;diteur de texte ne changeront pas le rendu du texte sur la partie publique. Si besoin, rapprochez-vous du d&#233;veloppeur pour en savoir davantage sur les mises en forme contraintes sur le site, et sur les &#233;ventuelles modifications possibles.</p>
		</article>
		<article class="article">
			<h3 id="interlignage">Interlignage</h3>
			<p>Il est pr&#233;f&#233;rable d'avoir un interlignage suffisamment large. On demande &#224; ce que l'interlignage soit au moins &#233;quivalent &#224; 1,5 fois la taille du texte.</p>
			<p>Il est tr&#232;s rare de trouver un &#233;diteur de texte qui vous permette de d&#233;finir l'interlignage. Ici encore, rapprochez-vous du d&#233;veloppeur de votre site pour cette probl&#233;matique.</p>
		</article>
	</main>

	<aside role="complementary" id="footer-block" class="clear">
		<div class="col-1-2">&nbsp;
		</div>

		<div class="col-1-2">
			<h2 id="correspondances-rgaa-3.0">Correspondances RGAA 3</h2>
			<ul>
			<li>Crit&#232;re 10.9 [AAA]</li>
			<li>Crit&#232;re 10.12 [AAA]</li>
			</ul>
		</div>
	</aside>
	
	
	<footer id="footer" role="contentinfo" class="clear">
		<h2>Licence d'utilisation</h2>
		<p class="logo-smgap"><a href="http://references.modernisation.gouv.fr/"><img src="img/modernisation-logo.jpg" alt="Secrétariat général pour le modernisation de l'action publique"></a></p>
		<p>Ce document est la propri&#233;t&#233; du Secr&#233;tariat g&#233;n&#233;ral &#224; la modernisation de l'action publique fran&#231;ais (SGMAP). Il est plac&#233; sous la <a href="https://www.etalab.gouv.fr/licence-ouverte-open-licence">licence ouverte 1.0 ou ult&#233;rieure</a>, &#233;quivalente &#224; une licence <i lang="en">Creative Commons BY</i>. Pour indiquer la paternit&#233;, ajouter un lien vers la version originale du document disponible sur le <a href="https://github.com/DISIC">compte <span lang="en">GitHub</span> de la DInSIC</a>.</p>
		
	</footer>

</div>
<script type="text/javascript" src="js/script.js"></script>
</body>
</html>
