<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="utf-8">
  <meta name="generator" content="pandoc">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
  <title>Fiche 5&nbsp;: Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></title>
  <!--[if lt IE 9]>
    <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
  <![endif]-->
  <link rel="stylesheet" href="css/styles.css" media="all">
  <link rel="stylesheet" href="css/print.css" media="print">
</head>
<body>
<div class="main-header">
	<div class="inside">
		<ul class="skip-links">
			<li><a href="#main">contenu</a></li>
			<li><a href="#navigation">navigation</a></li>
		</ul>
		<header role="banner" class="header  clear" id="banner">
			<p>Guide &#171;&#160;Contribuer sur le Web de mani&#232;re accessible&#160;&#187;</p>
			<h1 class="title">Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></h1>
		</header>

		<nav role="navigation" class="gp-sommaire" id="navigation" aria-label="Sommaire du guide">
			<button id="btnSommaire" aria-expanded="false">Sommaire</button>
			<ul class="sommaire is-hidden" id="sommaireToggle">
				<li><a href="index.html">Introduction</a></li>
				<li><a href="images.html">Fiche 1&nbsp;: Quand une image vaut mille mots</a></li>
				<li><a href="couleurs.html">Fiche 2&nbsp;: Les couleurs</a></li>
				<li><a href="cadres.html">Fiche 3&nbsp;: Embarquer des contenus d'autres sites sur ses pages</a></li>
				<li><a href="multimedia.html">Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</a></li>
				<li><a href="tableaux.html">Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></a></li>
				<li><a href="liens.html">Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</a></li>
				<li><a href="titres.html">Fiche 7&nbsp;: Les titres, ou le plan de la page</a></li>
				<li><a href="listes.html">Fiche 8&nbsp;: Listes &#224; puces et listes num&#233;rot&#233;es</a></li>
				<li><a href="langue.html">Fiche 9&nbsp;: Textes multilingues</a></li>
				<li><a href="citations.html">Fiche 10&nbsp;: Citations</a></li>
				<li><a href="mise-en-forme.html">Fiche 11&nbsp;: Mise en forme des textes</a></li>
				<li><a href="docs_telechargement.html">Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</a></li>
				<li><a href="definition.html">Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire</a></li>
				<li><a href="glossaire.html">Glossaire</a></li>
			</ul>
		</nav>
		<div class="github-link">
			<p><a href="https://github.com/DISIC/guide-contribuer_accessible">Télécharger<br />Contribuer</a></p>
		</div>
	</div>
</div>
<div id="wrapper">
	
	<nav role="navigation" class="internav clear">
		<ul>
			<li><a class="prev" href="multimedia.html"><span aria-hidden="true"> &laquo; </span> Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</a></li>
			<li><a class="next" href="liens.html">Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin <span aria-hidden="true"> &raquo; </span></a></li>
		</ul>
	</nav>

	<main id="main" role="main">
		<article class="article">	
			<p>De mani&#232;re g&#233;n&#233;rale&#160;:</p>
			<ul>
			<li>vous ne devez jamais cr&#233;er de tableau, sauf pour pr&#233;senter des donn&#233;es tabulaires&#160;;</li>
			<li>si vous avez des donn&#233;es tabulaires &#224; pr&#233;senter, &#233;viter autant que possible d'utiliser des tableaux, car m&#234;me quand ils sont techniquement accessibles, ils restent complexes &#224; appr&#233;hender.</li>
			</ul>
		</article>
		<article class="article">	
			<h2 id="lenjeu-pour-lutilisateur-handicap&#233;">L'enjeu pour l'utilisateur handicap&#233;</h2>
			<p>Un tableau est une structure particuli&#232;re. Un utilisateur pr&#233;sentant une d&#233;ficience visuelle (aveugle ou malvoyant) qui utilise un <a href="glossaire.html#lecteur-decran">lecteur d'&#233;cran</a> navigue diff&#233;remment dans celui-ci que dans les autres contenus textuels. Si ce tableau est complexe (par exemple, certains en-t&#234;tes ne s'appliquent pas &#224; toutes les cellules du tableau), il est d'autant plus difficile de naviguer dedans, et d'en comprendre surtout le sens.</p>
			<p>Pour accompagner l'utilisateur dans la lecture du tableau, il est important de d&#233;finir des en-t&#234;tes de colonnes ou de lignes. Si elles sont d&#233;finies, l'utilisateur de <a href="glossaire.html#lecteur-decran">lecteur d'&#233;cran</a>, qui n'a pas une vision globale du tableau, acc&#232;de &#224; ces en-t&#234;tes &#224; chaque fois qu'il consulte une cellule du tableau. Cela lui permet de se rep&#233;rer rapidement et ne pas avoir &#224; reparcourir tout un tableau pour savoir quels en-t&#234;tes d&#233;finissent la donn&#233;e en lecture.</p>
			<p>Un titre de tableau est &#233;galement indispensable. Il informe l'utilisateur sur le contenu (type de donn&#233;es, structure du tableau), ce qui lui permet de savoir s'il va ou non le parcourir et de se pr&#233;parer &#224; la lecture.</p>
			<p>Pour un utilisateur pr&#233;sentant une d&#233;ficience cognitive, pr&#233;senter le tableau par un titre offre &#233;galement des cl&#233;s de compr&#233;hension du contenu.</p>
		
		</article>
		<article class="article">	
			<h2 id="en-pratique-et-en-images">En pratique et en images</h2>
			<p>La plupart des &#233;diteurs de texte fournissent une fonction qui permet d'ins&#233;rer un tableau, <br />souvent symbolis&#233;e par une ic&#244;ne de tableau&nbsp;<img  class="inline-img"  src="img/tableau/icone-tableau.png" alt="" />.</p>
			<p>Ci-dessous un exemple de fen&#234;tre des propri&#233;t&#233;s d'un tableau dans l'&#233;diteur <span lang="en">CKEditor</span>.</p>
			<img src="img/tableau/ckeditor.png" alt="" />
			<p>L'outil ici propose de d&#233;finir des en-t&#234;tes. Vous pouvez choisir si les en-t&#234;tes de votre tableau sont en ligne ou en colonne (ou parfois les deux).</p>
			<p>Ensuite, vous devez d&#233;finir un titre de tableau. Il y a g&#233;n&#233;ralement un champ &#171;&#160;Titre du tableau&#160;&#187; &#224; renseigner. Si votre outil ne vous permet pas de r&#233;aliser cette action, &#224; d&#233;faut, utiliser un <a href="titres.html">titre de contenu</a>.</p>
			<p>Si vous cr&#233;ez un tableau de donn&#233;es simple, le titre du tableau doit permettre de comprendre les donn&#233;es en question. Par exemple&#160;: &#171;&#160;Chiffres d'affaires des diff&#233;rents secteurs d'activit&#233;s.&#160;&#187;</p>
			<p>Ci-dessous un exemple de tableau simple. Il poss&#232;de un titre &#171;&#160;Dates limites de d&#233;claration en ligne en fonction du d&#233;partement&#160;&#187; et 2 en-t&#234;tes de colonnes (&#171;&#160;Num&#233;ro du d&#233;partement de r&#233;sidence&#160;&#187; et &#171;&#160;Date limite de d&#233;claration en ligne&#160;&#187;).</p>
			<img src="img/tableau/simple.png" alt="" />
		</article>
		<article class="article">	
			<h3 id="tableau-de-donn&#233;es-complexe">Tableau de donn&#233;es complexe</h3>
			<p>Si vous cr&#233;ez un tableau complexe, vous devez fournir, en plus d'un titre, un r&#233;sum&#233; du tableau afin de lui fournir les cl&#233;s pour naviguer dedans. Ce r&#233;sum&#233; peut soit &#234;tre plac&#233; dans le titre du tableau directement, soit dans un texte juste avant le tableau.</p>
			<p>Le r&#233;sum&#233; d'un tableau complexe doit expliciter la structure du tableau et les donn&#233;es.</p>
			<p>Un tableau de donn&#233;es complexe demande g&#233;n&#233;ralement des ajustements dans le code du tableau. Vous n'avez pas la capacit&#233; (g&#233;n&#233;ralement limit&#233; par les fonctions de l'&#233;diteur de texte) de r&#233;aliser les ajustements n&#233;cessaires.</p>
			<p>Dans la mesure du possible, si votre tableau est complexe, essayez de le simplifier, quitte &#224; r&#233;aliser plusieurs tableaux simples.</p>
			<p>Ci-dessous un exemple de tableau complexe (issu et adapt&#233; du site de l'INSEE). Vous y trouvez des en-t&#234;tes de colonnes fusionn&#233;es (&#171;&#160;Variation (en %) au cours&#160;&#187;) ainsi que des en-t&#234;tes qui titrent des parties du tableau (toutes les lignes fusionn&#233;es du type &#171;&#160;a&#160;&#187;) Ensemble des m&#233;nages - France&#160;&#187;).</p>
			<div class="clear note">
				<div class="col-1-2" style="padding-top:1em">
					<img src="img/tableau/complexe.jpeg" alt="" />
				</div>
				<div class="col-1-2">
					<p>Dans ce cas de tableau complexe, pour faciliter la lecture, il serait par exemple possible de d&#233;couper ce tableau en 3 tableaux distincts, chacun correspondant aux 3 sections (a, b et c).</p>
					<p>Si ce tableau reste en l'&#233;tat, un r&#233;sum&#233; pertinent pourrait &#234;tre&#160;:</p>
					<p>&#171;&#160;R&#233;partition des m&#233;nages en France en fonction du type d'achats. On y trouve 3 grands regroupements&#160;:</p>
					<ul>
					<li>un premier regroupement concerne l'ensemble des m&#233;nages en France&#160;;</li>
					<li>un second regroupement concerne les m&#233;nages urbains dont le chef est ouvrier ou employ&#233;&#160;;</li>
					<li>un troisi&#232;me regroupement concerne les m&#233;nages du 1<sup>er</sup> quintile de la distribution des niveaux de vie.</li>
					</ul>
					<p>Pour chacun des regroupements&#160;:</p>
					<ul>
					<li>la premi&#232;re colonne repr&#233;sente les pond&#233;rations pour l'ann&#233;e 2015&#160;;</li>
					<li>la seconde colonne repr&#233;sente l'indice pour le mois d'ao&#251;t 2015&#160;;</li>
					<li>la troisi&#232;me colonne repr&#233;sente la variation en pourcent au cours du dernier mois&#160;;</li>
					<li>la derni&#232;re colonne repr&#233;sente la variation en pourcent au cours des 12 derniers mois.</li>
					</ul>
				</div>
			</div>
		</article>
		<article class="article">	
			<h2 id="m&#233;mo-pour-agir">M&#233;mo pour agir</h2>
			<ul>
			<li>Ai-je vraiment besoin de cr&#233;er un tableau ?</li>
			<li>Mon tableau a-t-il un titre ?</li>
			<li>Mes donn&#233;es sont-elles compr&#233;hensibles ? Les en-t&#234;tes sont-ils correctement d&#233;clar&#233;s ?</li>
			</ul>
		</article>
	</main>

	<aside role="complementary" id="footer-block" class="clear">
		<div class="col-1-2">
			<h2 id="voir-aussi...">Voir aussi...</h2>
			<p>Si votre outil ne vous permet de cr&#233;er des titres de tableaux, cr&#233;ez un titre de contenu. Voir la <a href="titres.html">fiche 7&#160;: Les titres, ou le plan de la page</a></p>
			<h2 id="voir-ailleurs">Voir ailleurs</h2>
			<ul>
			<li><a href="http://portail.unice.fr/access-key/videos/les-tableaux">Vid&#233;o sur l'accessibilit&#233; des tableaux</a>.</li>
			</ul>
		</div>
		<div class="col-1-2">
			<h2 id="correspondances-rgaa-3.0">Correspondances RGAA 3.0</h2>
			<ul>
			<li>Crit&#232;re 5.1 [A]</li>
			<li>Crit&#232;re 5.2 [A]</li>
			<li>Crit&#232;re 5.4 [A]</li>
			<li>Crit&#232;re 5.5 [A]</li>
			</ul>
		</div>
	</aside>
	
	
	<footer id="footer" role="contentinfo" class="clear">
		<h2>Licence d'utilisation</h2>
		<p class="logo-smgap"><a href="http://references.modernisation.gouv.fr/"><img src="img/modernisation-logo.jpg" alt="Secrétariat général pour le modernisation de l'action publique"></a></p>
		<p>Ce document est la propri&#233;t&#233; du Secr&#233;tariat g&#233;n&#233;ral &#224; la modernisation de l'action publique fran&#231;ais (SGMAP). Il est plac&#233; sous la <a href="https://www.etalab.gouv.fr/licence-ouverte-open-licence">licence ouverte 1.0 ou ult&#233;rieure</a>, &#233;quivalente &#224; une licence <i lang="en">Creative Commons BY</i>. Pour indiquer la paternit&#233;, ajouter un lien vers la version originale du document disponible sur le <a href="https://github.com/DISIC">compte <span lang="en">GitHub</span> de la DInSIC</a>.</p>
		
	</footer>

</div>
<script type="text/javascript" src="js/script.js"></script>
</body>
</html>
