<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="utf-8">
  <meta name="generator" content="pandoc">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
  <title>Fiche 2&nbsp;: Couleurs</title>

  <!--[if lt IE 9]>
    <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
  <![endif]-->
  <link rel="stylesheet" href="css/styles.css" media="all">
  <link rel="stylesheet" href="css/print.css" media="print">
</head>
<body>

<div class="main-header">
	<div class="inside">
		<ul class="skip-links">
			<li><a href="#main">contenu</a></li>
			<li><a href="#navigation">navigation</a></li>
		</ul>
		<header role="banner" class="header  clear" id="banner">
			<h1 class="title">Guide &#171;&#160;Contribuer sur le Web de mani&#232;re accessible&#160;&#187;</h1>
		</header>
		<nav role="navigation" class="gp-sommaire" id="navigation" aria-label="Sommaire du guide">
			<button id="btnSommaire" aria-expanded="false">Sommaire</button>
			<ul class="sommaire is-hidden" id="sommaireToggle">
				<li><a href="index.html">Introduction</a></li>
				<li><a href="images.html">Fiche 1&nbsp;: Quand une image vaut mille mots</a></li>
				<li><a href="couleurs.html">Fiche 2&nbsp;: Les couleurs</a></li>
				<li><a href="cadres.html">Fiche 3&nbsp;: Embarquer des contenus d'autres sites sur ses pages</a></li>
				<li><a href="multimedia.html">Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</a></li>
				<li><a href="tableaux.html">Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></a></li>
				<li><a href="liens.html">Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</a></li>
				<li><a href="titres.html">Fiche 7&nbsp;: Les titres, ou le plan de la page</a></li>
				<li><a href="listes.html">Fiche 8&nbsp;: Listes &#224; puces et listes num&#233;rot&#233;es</a></li>
				<li><a href="langue.html">Fiche 9&nbsp;: Textes multilingues</a></li>
				<li><a href="citations.html">Fiche 10&nbsp;: Citations</a></li>
				<li><a href="mise-en-forme.html">Fiche 11&nbsp;: Mise en forme des textes</a></li>
				<li><a href="docs_telechargement.html">Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</a></li>
				<li><a href="definition.html">Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire</a></li>
				<li><a href="glossaire.html">Glossaire</a></li>
			</ul>
		</nav>
		<div class="github-link">
			<p><a title="Contribuer sur Github" href="https://github.com/DISIC/guide-contribuer_accessible">Contribuer</a>
			<a class="pdfdown" title="Télécharger le guide Contribuer sur le web de manière accessible (pdf, 848ko)" href="http://references.modernisation.gouv.fr/sites/default/files/guide-contribuer-accessible-3.pdf" download>Télécharger</a></p>
		</div>
	</div>
</div>

<div id="wrapper">
	
	<nav role="navigation" class="internav clear">
		<ul>
			<li><a class="prev" href="images.html"><span aria-hidden="true"> &laquo; </span> Fiche 1&nbsp;: Quand une image vaut mille mots</a></li>
			<li><a class="next" href="cadres.html">Fiche 3&nbsp;: Embarquer des contenus d'autres sites sur ses pages <span aria-hidden="true"> &raquo; </span></a></li>
		</ul>
	</nav>
	
	<main id="main" role="main">
		<h1 class="fiche-title">Fiche 2&nbsp;: Couleurs</h1>
		<article class="article">
			<p>Que ce soit sur une image, dans un texte ou encore dans une vid&#233;o, vous devez pr&#234;ter une attention particuli&#232;re &#224; l'utilisation que vous faites des couleurs.</p>
		</article>
		<article class="enjeu article">
			<h2 id="lenjeu-pour-lutilisateur-handicap&#233;">L'enjeu pour l'utilisateur handicap&#233;</h2>
			<p>Les couleurs sont une probl&#233;matique importante pour les utilisateurs qui ne per&#231;oivent pas du tout les couleurs, notamment les personnes aveugles, tr&#232;s malvoyantes ou celles qui ont des d&#233;ficiences de perception des couleurs (daltonisme par exemple).</p>
			<p>La couleur est parfois le seul vecteur utilis&#233; pour donner de l'information. Par exemple, dans une liste, vous avez mis en rouge les &#233;l&#233;ments obligatoires et laiss&#233; en noir les &#233;l&#233;ments optionnels. Un utilisateur qui ne peut pas voir ces couleurs n'aura pas acc&#232;s &#224; cette information. Vous devez toujours fournir un autre moyen, et de pr&#233;f&#233;rence textuel, pour que tous les utilisateurs, quelle que soit leur capacit&#233; de perception, puissent avoir acc&#232;s &#224; cette information.</p>
			<p>Une autre probl&#233;matique li&#233;e &#224; la couleur concerne les contrastes. Pour un utilisateur qui a des difficult&#233;s &#224; percevoir les contrastes, certaines &#233;critures peuvent &#234;tre impossibles &#224; lire si la couleur d'&#233;criture n'est pas suffisamment contrast&#233;e par rapport &#224; la couleur du fond.</p>
		</article>
		<article class="article">
			<h2 id="en-pratique-et-en-images">En pratique et en images</h2>
			<h3 id="les-contrastes-de-couleurs">Les contrastes de couleurs</h3>
			<p>Les contrastes de couleurs concernent le rapport de contraste entre la couleur d'&#233;criture d'un texte et sa couleur de fond.</p>
			<p>Ces contrastes concernent&#160;:</p>
			<ul>
			<li>les textes que vous saisissez dans l'&#233;diteur&#160;;</li>
			<li>les textes pr&#233;sents dans les images&#160;;</li>
			<li>les textes incrust&#233;s dans les vid&#233;os.</li>
			</ul>
			<p>Il existe des valeurs qui assurent un contraste minimum suffisant pour une large part des utilisateurs ayant des difficult&#233;s de perception des couleurs.</p>
			<p>Pour &#233;valuer les contrastes des &#233;l&#233;ments que vous ins&#233;rez, vous pouvez vous aider d'outils&#160;:</p>
			<ul>
			<li><a href="https://addons.mozilla.org/fr/firefox/addon/wcag-contrast-checker/">l'extension WCAG <span lang="en">Contrast Checker</span> pour <span lang="en">Firefox</span></a> vous permet de r&#233;aliser un contr&#244;le rapide sur votre page web des contenus textuels, elle poss&#232;de &#233;galement une pipette qui vous permet de piocher vous-m&#234;me des couleurs &#224; analyser&#160;;</li>
			<li><a href="https://www.visionaustralia.org/business-and-professionals/digital-accessibility-services/resources/tools-to-download/colour-contrast-analyser-2-2-for-web-pages">le logiciel <span lang="en">Colour Contrast Analyser</span> (compatible Windows - source du lien en anglais)</a>, gr&#226;ce &#224; une pipette, vous permet d'aller piocher des couleurs sur tous les formats de documents (web, bureautique, vid&#233;os ...) pour les analyser&#160;;</li>
			<li><a href="https://addons.mozilla.org/fr/firefox/addon/tanaguru-contrast-finder/">l'extension Tanaguru <span lang="en">Contrast Finder</span></a> vous permet de r&#233;aliser un contr&#244;le rapide sur votre page web des contenus textuels et vous fournit un moyen de trouver des contrastes valides proches, si possible, de vos couleurs originales.</li>
			</ul>
			<p>Pour vous aider, vous pouvez consulter <a href="https://support.mozilla.org/fr/kb/trouver-installer-modules-firefox">l'aide sur l'installation d'extension sur <span lang="en">Firefox</span></a>.</p>
			<p>Ces logiciels, en plus de vous fournir une &#233;valuation chiffr&#233;e du contraste, vous fournissent directement l'&#233;valuation au regard de la norme. D'un coup d'&#339;il, vous pouvez savoir si vos contrastes sont suffisants ou non.</p>
			<p>Ci-dessous, un exemple d'&#233;valuation des couleurs d'un site avec WCAG <span lang="en">Contrast Checker</span>.</p>
			<img src="img/couleurs/wcag-contrast.png" alt="" />
		</article>
		<article class="article">
			<h3 id="linformation-par-la-couleur">L'information par la couleur</h3>
			<p>Certaines images ou mises en forme peuvent v&#233;hiculer de l'information gr&#226;ce &#224; la couleur. C'est souvent le cas des graphiques par exemple. La couleur symbolise un &#233;l&#233;ment et cette couleur est d&#233;finie dans une l&#233;gende.</p>
			<h4 id="exemple-dun-graphique">Exemple d'un graphique</h4>
			<p>Lorsqu'il s'agit d'un graphique pr&#233;sent dans une image, la meilleure solution est de r&#233;aliser une description d&#233;taill&#233;e de cette image. Nous vous renvoyons &#224; la <a href="images.html">fiche 1&#160;: Quand une image vaut mille mots</a> pour comprendre comment r&#233;aliser une description d&#233;taill&#233;e.</p>
			<p>Ci-dessous un exemple de graphique o&#249; l'information par la couleur est indispensable pour le comprendre. La meilleure alternative qui soit est alors de r&#233;diger une description d&#233;taill&#233;e du graphique.</p>
			<div class="clear note">
				<div class="col-1-2">
					<p><img src="img/couleurs/camembert.JPG" alt="R&#233;partition de la population par taille de communes (description d&#233;taill&#233;e ci-dessous)" /></p>
				</div>
				<div class="col-1-2">
					<p>R&#233;partition de la population par taille de communes (description d&#233;taill&#233;e du graphique)&#160;:</p>
					<ul>
					<li>Les communes de moins de 1 000 habitants repr&#233;sentent 22,3% de la population.</li>
					<li>Les communes qui comptent entre 1 000 et 5 000 habitants repr&#233;sentent 23,5% de la population.</li>
					<li>Les communes qui comptent entre 5 000 et 10 000 habitants repr&#233;sentent 12,3% de la population.</li>
					<li>Les communes qui comptent entre 10 000 et 20 000 habitants repr&#233;sentent 11,6% de la population.</li>
					<li>Les communes qui comptent entre 20 000 et 50 000 habitants repr&#233;sentent 17,0% de la population.</li>
					<li>Les communes de plus de 50 000 habitants repr&#233;sentent 13,2% de la population.</li>
					</ul>
				</div>
			</div>

			<h4 id="exemple-dune-illustration">Exemple d'une illustration</h4>
			<p>Sur les images, la couleur peut apporter une information. Par exemple, sur l'image ci-dessous, la couleur met en &#233;vidence la zone du cerveau concern&#233;e dans un article associ&#233;. L'information v&#233;hicul&#233;e ici est la position de la zone en question. Cette information doit se retrouver dans le texte adjacent &#224; l'image. Par exemple, on pourra retrouver dans le texte&#160;: &#171; Le noyau est situ&#233; &#224; l'arri&#232;re du cerveau &#187;.</p>
			<div class="clear">
				<div class="col-1-2">
					<img src="img/couleurs/info-couleurs.png" alt="" />
				</div>
				<div class="col-1-2">
					<p>Il est important que cette information ne soit pas uniquement pr&#233;sente dans le <a href="glossaire.html#texte-de-remplacement">texte de remplacement de l'image</a>. En effet, le texte de remplacement n'est bien souvent accessible qu'aux personnes qui utilisent un <a href="glossaire.html#lecteur-decran">lecteur d'&#233;cran</a>. Les personnes qui ont des difficult&#233;s de perception des couleurs n'utilisent pas ces logiciels et n'auront pas acc&#232;s au texte de remplacement. C'est pourquoi il est important que la description de l'information donn&#233;e par la couleur soit r&#233;alis&#233;e de mani&#232;re textuelle et visible.</p>
				</div>
			</div>
		</article>
		<article class="article memo">
			<h2 id="m&#233;mo-pour-agir">M&#233;mo pour agir</h2>
			<ul>
			<li>J'ai mis plusieurs textes en couleurs dans mon contenu. Cette information apporte-t-elle un sens &#224; mon contenu ou est-ce simplement d&#233;coratif&#160;?</li>
			<li>Sur l'image que j'ai ins&#233;r&#233;e, plusieurs zones sont color&#233;es. Cette information est-elle importante&#160;? Est-ce que je la retrouve dans le texte qui l'accompagne&#160;?</li>
			<li>L'image que j'ai ins&#233;r&#233;e poss&#232;de du texte. Ce texte est-il suffisamment contrast&#233; par rapport &#224; la couleur de fond&#160;?</li>
			</ul>
		</article>
	</main>

	<aside role="complementary" id="footer-block" class="clear">
		<div class="col-1-2">
			<h2 id="voir-aussi...">Voir aussi...</h2>
			<ul>
			<li>R&#233;diger des descriptions d&#233;taill&#233;es lorsque les images comportent de l'information donn&#233;e par la couleur. Voir la <a href="images.html">fiche 1&#160;: Quand une image vaut mille mots</a>.</li>
			</ul>
			<h2 id="voir-ailleurs...">Voir ailleurs...</h2>
			<ul>
			<li><a href="http://uxmovement.com/buttons/making-selected-button-states-clear-for-color-blind-users">Cr&#233;er des &#233;tats de boutons accessibles pour les utilisateurs ne percevant pas la couleur (ressources en anglais)</a>.</li>
			</ul>
		</div>

		<div class="col-1-2">
			<h2 id="correspondances-rgaa-3.0">Correspondances RGAA 3</h2>
			<ul>
				<li>Crit&#232;re 3.1 [A]</li>
				<li>Crit&#232;re 3.2 [A]</li>
				<li>Crit&#232;re 3.3 [AA]</li>
				<li>Crit&#232;re 3.4 [AAA]</li>
			</ul>
		</div>
	</aside>
	
	
	<footer id="footer" role="contentinfo" class="clear">
		<h2>Licence d'utilisation</h2>
		<p class="logo-smgap"><a href="http://references.modernisation.gouv.fr/"><img src="img/modernisation-logo.jpg" alt="Secrétariat général pour le modernisation de l'action publique"></a></p>
		<p>Ce document est la propri&#233;t&#233; du Secr&#233;tariat g&#233;n&#233;ral &#224; la modernisation de l'action publique fran&#231;ais (SGMAP). Il est plac&#233; sous la <a href="https://www.etalab.gouv.fr/licence-ouverte-open-licence">licence ouverte 1.0 ou ult&#233;rieure</a>, &#233;quivalente &#224; une licence <i lang="en">Creative Commons BY</i>. Pour indiquer la paternit&#233;, ajouter un lien vers la version originale du document disponible sur le <a href="https://github.com/DISIC">compte <span lang="en">GitHub</span> de la DInSIC</a>.</p>
		
	</footer>

</div>
<script type="text/javascript" src="js/script.js"></script>
</body>
</html>
