<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="utf-8">
  <meta name="generator" content="pandoc">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
  <title>Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</title>

  <!--[if lt IE 9]>
    <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
  <![endif]-->

  <link rel="stylesheet" href="css/styles.css" media="all">
  <link rel="stylesheet" href="css/print.css" media="print">
</head>
<body>

<div class="main-header">
	<div class="inside">
		<ul class="skip-links">
			<li><a href="#main">contenu</a></li>
			<li><a href="#navigation">navigation</a></li>
		</ul>
		<header role="banner" class="header  clear" id="banner">
			<h1 class="title">Guide &#171;&#160;Contribuer sur le Web de mani&#232;re accessible&#160;&#187;</h1>
		</header>

		<nav role="navigation" class="gp-sommaire" id="navigation" aria-label="Sommaire du guide">
			<button id="btnSommaire" aria-expanded="false">Sommaire</button>
			<ul class="sommaire is-hidden" id="sommaireToggle">
				<li><a href="index.html">Introduction</a></li>
				<li><a href="images.html">Fiche 1&nbsp;: Quand une image vaut mille mots</a></li>
				<li><a href="couleurs.html">Fiche 2&nbsp;: Les couleurs</a></li>
				<li><a href="cadres.html">Fiche 3&nbsp;: Embarquer des contenus d'autres sites sur ses pages</a></li>
				<li><a href="multimedia.html">Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</a></li>
				<li><a href="tableaux.html">Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></a></li>
				<li><a href="liens.html">Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</a></li>
				<li><a href="titres.html">Fiche 7&nbsp;: Les titres, ou le plan de la page</a></li>
				<li><a href="listes.html">Fiche 8&nbsp;: Listes &#224; puces et listes num&#233;rot&#233;es</a></li>
				<li><a href="langue.html">Fiche 9&nbsp;: Textes multilingues</a></li>
				<li><a href="citations.html">Fiche 10&nbsp;: Citations</a></li>
				<li><a href="mise-en-forme.html">Fiche 11&nbsp;: Mise en forme des textes</a></li>
				<li><a href="docs_telechargement.html">Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</a></li>
				<li><a href="definition.html">Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire</a></li>
				<li><a href="glossaire.html">Glossaire</a></li>
			</ul>
		</nav>
		<div class="github-link">
			<p><a title="Contribuer sur Github" href="https://github.com/DISIC/guide-contribuer_accessible">Contribuer</a>
			<a class="pdfdown" title="Télécharger le guide Contribuer sur le web de manière accessible (pdf, 46ko)" href="http://references.modernisation.gouv.fr/sites/default/files/guide-contribuer-accessible-3.pdf" rel="download">Télécharger</a></p>
		</div>
	</div>
</div>

<div id="wrapper">
	
	<nav role="navigation" class="internav clear">
		<ul>
			<li><a class="prev" href="tableaux.html"><span aria-hidden="true"> &laquo; </span> Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></a></li>
			<li><a class="next" href="titres.html">Fiche 7&nbsp;: Les titres, ou le plan de la page <span aria-hidden="true"> &raquo; </span></a></li>
		</ul>
	</nav>
	
	<main id="main" role="main">
		<h1 class="fiche-title">Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</h1>
		<article class="article">
			<p>Un lien permet de naviguer entre les pages d'un site ou renvoyer vers un autre site. Un lien est d&#233;fini par deux &#233;l&#233;ments importants&#160;:</p>
			<ul>
			<li>son intitul&#233;, le texte visible cliquable par les utilisateurs&#160;;</li>
			<li>son titre (parfois nomm&#233; <i lang="en">title</i>)&#160;: c'est l'infobulle qui appara&#238;t au survol du lien par la souris.</li>
			</ul>
		</article>
		<article class="article">
			<h2 id="lenjeu-pour-lutilisateur-handicap&#233;">L'enjeu pour l'utilisateur handicap&#233;</h2>
			<p>Pour un utilisateur pr&#233;sentant une d&#233;ficience visuelle (aveugle ou malvoyant) qui utilise un <a href="glossaire.html#lecteur-decran">lecteur d'&#233;cran</a> et qui n'a pas une vision globale de la page, ou qui navigue entre les liens, il est important de comprendre la fonction d'un lien.</p>
			<p>Pour des utilisateurs pr&#233;sentant des d&#233;ficiences cognitives, des liens peu explicites n'incitent pas &#224; l'action. L'utilisateur ne sait pas, ne comprend pas vers quelle page il se dirige si l'intitul&#233; du lien ne l'explique pas suffisamment.</p>
			<p>Lorsque les liens sont constitu&#233;s par des images seules, c'est le texte alternatif de l'image qui constitue l'intitul&#233; du lien. &#192; ce moment, le texte alternatif &#224; renseigner n'est plus la description de l'image mais la destination du lien. Si l'image n'a pas d'alternative, le lien est alors un lien vide. Un utilisateur qui navigue &#224; la voix ne pourra par exemple par cliquer sur ce lien, ne sachant pas comment les nommer.</p>
		</article>
		<article class="article">
			<h2 id="en-pratique-et-en-images">En pratique et en images</h2>
			<p>Tous les &#233;diteurs permettent d'ins&#233;rer des liens facilement. G&#233;n&#233;ralement, la fonction qui permet de d&#233;finir les propri&#233;t&#233;s d'un lien est repr&#233;sent&#233;e par une ic&#244;ne de cha&#238;non&#160;: <img class="inline-img"  src="img/liens/icone-liens.png" alt="" /></p>
			<p>Ci-dessous un exemple d'insertion de lien dans l'&#233;diteur de texte de <span lang="en">Wordpress</span>.</p>
			<img src="img/liens/wordpress.png" alt="" />
			<h3 id="intitul&#233;-pertinent">Intitul&#233; pertinent</h3>
			<p>Pour d&#233;finir l'intitul&#233; de votre lien, s&#233;lectionnez la portion de texte n&#233;cessaire pour que le lien soit suffisamment explicite.</p>
			<p>Dans ce cas pr&#233;cis, on voit un champ &#171;&#160;<i lang="en">Title</i>&#160;&#187;, qui va permettre de d&#233;finir, si n&#233;cessaire, un titre (une infobulle). Si vous d&#233;cidez de cr&#233;er une infobulle, vous devez vous assurer&#160;:</p>
			<ul>
			<li>que l'intitul&#233; du lien ne peut pas &#234;tre rendu explicite lui-m&#234;me&#160;;</li>
			<li>que l'infobulle reprend au moins l'intitul&#233; du lien (par exemple ici, l'infobulle doit reprendre au moins &#171;&#160;Page d'aide&#160;&#187;).</li>
			</ul>
		</article>
		<article class="article">
			<h3 id="ouverture-dans-une-nouvelle-fen&#234;tre">Ouverture dans une nouvelle fen&#234;tre</h3>
			<p>Dans certains &#233;diteurs de textes, vous avez la possibilit&#233; de demander &#224; ce qu'un lien s'ouvre dans une nouvelle fen&#234;tre lorsque l'utilisateur clique dessus. Si vous choisissez cette option, vous devez syst&#233;matiquement en informer l'utilisateur. La m&#233;thode recommand&#233;e est de le faire gr&#226;ce au titre de lien (infobulle), sur le mod&#232;le&#160;: &#171;&#160;Intitul&#233; du lien - nouvelle fen&#234;tre&#160;&#187;.</p>
			<p><strong>Note&#160;: le d&#233;veloppeur de votre site a pu mettre en place une fonctionnalit&#233; qui d&#233;tecte automatiquement les liens qui s'ouvrent dans une nouvelle fen&#234;tre et qui permet de modifier le titre du lien. Renseignez-vous aupr&#232;s du service informatique sur l'existence de cette fonctionnalit&#233;.</strong></p>
			<p>Ci-dessous un exemple d'insertion de lien qui ouvre dans une nouvelle fen&#234;tre dans l'&#233;diteur de texte de <span lang="en">Tiny</span>MCE.</p>
			<img src="img/liens/nouvelle-fenetre.png" alt="" />
			<p>Dans <span lang="en">Tiny</span>MCE, il faut &#233;diter les propri&#233;t&#233;s du lien&#160;:</p>
			<ul>
				<li>Dans le champ <i lang="en">Target</i>, choisir <i lang="en">New Window</i> si vous souhaitez que le lien ouvre une nouvelle fen&#234;tre&#160;;</li>
				<li>Dans le champ <i lang="en">Text to display</i> s'affiche le texte que vous avez s&#233;lectionn&#233; pour cr&#233;er le lien&#160;;</li>
				<li>Dans le champ <i lang="en">Title</i> (titre ou infobulle), reprenez l'intitul&#233; du lien et ajoutez la mention &#171;&#160;nouvelle fen&#234;tre&#160;&#187;.</li>
			</ul>
		</article>
		<article class="article">
			<h3 id="apparence-des-liens">Apparence des liens</h3>
			<p>Dans la charte graphique du site a &#233;t&#233; d&#233;finie une apparence pour les liens (couleur, soulignement, etc.). Vous ne devez pas modifier cette apparence, m&#234;me si votre &#233;diteur de texte vous le permet, <strong>au risque de cr&#233;er une rupture dans l'exp&#233;rience utilisateur et de cr&#233;er des probl&#232;mes de contraste insuffisant pouvant nuire &#224; la lisibilit&#233;.</strong></p>
			<p>En effet, les liens doivent &#234;tre distingu&#233;s visuellement du reste du texte environnant selon certaines recommandations. Cette apparence a &#233;t&#233; d&#233;finie au moment de la conception du site et le d&#233;veloppeur a int&#233;gr&#233; les recommandations pour tous les liens.</p>
			<p>Un guide compl&#233;mentaire destin&#233; &#224; la phase de conception traitera notamment de ce sujet. Il sera mis &#224; disposition ult&#233;rieurement lorsqu'il sera r&#233;dig&#233;.</p>
		</article>
		<article class="article">
			<h2 id="m&#233;mo-pour-agir">M&#233;mo pour agir</h2>
			<ul>
			<li>Si je regarde le texte de mes liens, est-ce que je comprends o&#249; je vais en cliquant dessus&#160;?</li>
			<li>&#201;vitez au maximum les intitul&#233;s g&#233;n&#233;riques du type&#160;: cliquez-ici, ici, lire la suite, visitez cette page, t&#233;l&#233;charger&#8230;</li>
			<li>Deux de mes liens ont des intitul&#233;s identiques. Renvoient-ils bien vers la m&#234;me page&#160;?</li>
			</ul>
		</article>
	</main>

	<aside role="complementary" id="footer-block" class="clear">
		<div class="col-1-2">
			<h2 id="voir-aussi...">Voir aussi...</h2>
			<ul>
			<li>Pour les images liens, renseignez un texte de remplacement &#224; l'image pour d&#233;finir l'intitul&#233; du lien. Voir la <a href="images.html">fiche 1&#160;: Quand une image vaut mille mots</a></li>
			<li>Pour une explication plus d&#233;taill&#233;e des contrastes de couleurs, nous vous renvoyons &#224; la <a href="couleurs.html">fiche 2&#160;: Les couleurs</a>.</li>
			</ul>
			<h2 id="voir-ailleurs">Voir ailleurs</h2>
			<ul>
			<li><a href="http://ics.utc.fr/capa/DOCS/SP4/Tuto/02/co/02-CAPA_BonnesPratiques_7.html">Bonnes pratiques pour l'accessibilit&#233; des liens (Sur le site de l'Unit&#233; ing&#233;nierie des contenus et savoirs)</a></li>
			</ul>
			</div>

		<div class="col-1-2">
			<h2 id="correspondances-rgaa-3.0">Correspondances RGAA 3.0</h2>
			<ul>
			<li>Crit&#232;re 6.1 [A]</li>
			<li>Crit&#232;re 6.2 [A]</li>
			<li>Crit&#232;re 6.3 [AAA]</li>
			<li>Crit&#232;re 6.4 [A]</li>
			<li>Crit&#232;re 10.6 [A]</li>
			</ul>
		</div>
	</aside>
	
	<footer id="footer" role="contentinfo" class="clear">
		<h2>Licence d'utilisation</h2>
		<p class="logo-smgap"><a href="http://references.modernisation.gouv.fr/"><img src="img/modernisation-logo.jpg" alt="Secrétariat général pour le modernisation de l'action publique"></a></p>
		<p>Ce document est la propri&#233;t&#233; du Secr&#233;tariat g&#233;n&#233;ral &#224; la modernisation de l'action publique fran&#231;ais (SGMAP). Il est plac&#233; sous la <a href="https://www.etalab.gouv.fr/licence-ouverte-open-licence">licence ouverte 1.0 ou ult&#233;rieure</a>, &#233;quivalente &#224; une licence <i lang="en">Creative Commons BY</i>. Pour indiquer la paternit&#233;, ajouter un lien vers la version originale du document disponible sur le <a href="https://github.com/DISIC">compte <span lang="en">GitHub</span> de la DInSIC</a>.</p>
		
	</footer>

</div>
<script type="text/javascript" src="js/script.js"></script>
</body>
</html>
