<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="utf-8">
  <meta name="generator" content="pandoc">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
  <title>Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</title>

  <!--[if lt IE 9]>
    <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
  <![endif]-->
  <link rel="stylesheet" href="css/styles.css" media="all">
  <link rel="stylesheet" href="css/print.css" media="print">
</head>
<body>
<div class="main-header">
	<div class="inside">
		<ul class="skip-links">
			<li><a href="#main">contenu</a></li>
			<li><a href="#navigation">navigation</a></li>
		</ul>
		<header role="banner" class="header  clear" id="banner">
			<h1 class="title">Guide &#171;&#160;Contribuer sur le Web de mani&#232;re accessible&#160;&#187;</h1>
		</header>

		<nav role="navigation" class="gp-sommaire" id="navigation" aria-label="Sommaire du guide">
			<button id="btnSommaire" aria-expanded="false">Sommaire</button>
			<ul class="sommaire is-hidden" id="sommaireToggle">
				<li><a href="index.html">Introduction</a></li>
				<li><a href="images.html">Fiche 1&nbsp;: Quand une image vaut mille mots</a></li>
				<li><a href="couleurs.html">Fiche 2&nbsp;: Les couleurs</a></li>
				<li><a href="cadres.html">Fiche 3&nbsp;: Embarquer des contenus d'autres sites sur ses pages</a></li>
				<li><a href="multimedia.html">Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</a></li>
				<li><a href="tableaux.html">Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></a></li>
				<li><a href="liens.html">Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</a></li>
				<li><a href="titres.html">Fiche 7&nbsp;: Les titres, ou le plan de la page</a></li>
				<li><a href="listes.html">Fiche 8&nbsp;: Listes &#224; puces et listes num&#233;rot&#233;es</a></li>
				<li><a href="langue.html">Fiche 9&nbsp;: Textes multilingues</a></li>
				<li><a href="citations.html">Fiche 10&nbsp;: Citations</a></li>
				<li><a href="mise-en-forme.html">Fiche 11&nbsp;: Mise en forme des textes</a></li>
				<li><a href="docs_telechargement.html">Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</a></li>
				<li><a href="definition.html">Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire</a></li>
				<li><a href="glossaire.html">Glossaire</a></li>
			</ul>
		</nav>
		<div class="github-link">
			<p><a title="Contribuer sur Github" href="https://github.com/DISIC/guide-contribuer_accessible">Contribuer</a>
			<a class="pdfdown" title="Télécharger le guide Contribuer sur le web de manière accessible (pdf, 46ko)" href="http://references.modernisation.gouv.fr/sites/default/files/guide-contribuer-accessible-3.pdf" rel="download">Télécharger</a></p>
		</div>
	</div>
</div>
<div id="wrapper">
	
	<nav role="navigation" class="internav clear">
		<ul>
			<li><a class="prev" href="cadres.html"><span aria-hidden="true"> &laquo; </span> Fiche 3&nbsp;: Embarquer des contenus d'autres sites sur ses pages</a></li>
			<li><a class="next" href="tableaux.html">Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i> <span aria-hidden="true"> &raquo; </span></a></li>
		</ul>
	</nav>
	
	<main id="main" role="main">
		<h1 class="fiche-title">Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</h1>
		<article class="article">
			<p>La majeure partie des contenus multim&#233;dias que vous rencontrerez sont des vid&#233;os (avec ou sans bande son) ou des fichiers sons.</p>
			<p>Entrent &#233;galement dans la cat&#233;gorie de contenus multim&#233;dias, les &#233;l&#233;ments interactifs comme les animations ou publicit&#233;s en Flash par exemple.</p>
		</article>
		<article class="enjeu article">
			<h2 id="lenjeu-pour-lutilisateur-handicap&#233;">L'enjeu pour l'utilisateur handicap&#233;</h2>
			<p>Les contenus multim&#233;dias peuvent v&#233;hiculer de l'information par les images (actions, textes incrust&#233;s) ou par le son (bande sonore d'une vid&#233;o, ou fichier son seul).</p>
			<p>Souvent des textes sont incrust&#233;s dans les vid&#233;os, pour pr&#233;senter un orateur, donner une date... et ne sont pas repris dans le discours. Les utilisateurs qui ont une d&#233;ficience visuelle (aveugles ou malvoyants) qui ne peuvent pas appr&#233;hender les images, ou celles qui ont des difficult&#233;s &#224; comprendre l'information visuelle pr&#233;sente &#224; l'&#233;cran pour des raisons cognitives, auront besoin que ces informations visuelles leur soit d&#233;crites. Il faut pouvoir, par un autre moyen que l'image, restituer l'information &#224; l'utilisateur.</p>
			<p>Les utilisateurs qui pr&#233;sentent une d&#233;ficience auditive, sourds et malentendants, ne pouvant pas ou difficilement percevoir le contenu audio des documents multim&#233;dia, auront besoin d'une traduction en langue des signes ou de sous-titres pour comprendre le contenu audio du contenu multim&#233;dia.</p>
		</article>
		<article class="article">
			<h2 id="en-pratique-et-en-images">En pratique et en images</h2>
			<h3 id="donner-un-titre">Donner un titre</h3>
			<p>Lorsque vous ins&#233;rez du contenu multim&#233;dia, vous devez le faire pr&#233;c&#233;der d'un titre. Ce titre peut reprendre celui de l'&#233;l&#233;ment lui-m&#234;me s'il en poss&#232;de un. Il doit permettre de comprendre quelle est l'information pr&#233;sent&#233;e dans ce contenu. Tout &#233;l&#233;ment multim&#233;dia doit &#234;tre consid&#233;r&#233; comme un contenu &#224; part enti&#232;re, et donc structur&#233; par un titre. Nous vous renvoyons &#224; la fiche <a href="titres.html">Les titres, ou le plan de la page</a> pour la mise en place de ce titre.</p>
		</article>
		<article class="article">
			<h3 id="permettre-la-compr&#233;hension-des-contenus-multim&#233;dias-sans-le-son">Permettre la compr&#233;hension des contenus multim&#233;dias sans le son</h3>
			<h4 id="sous-titres">Sous-titres</h4>
			<p>Il ne faut pas confondre le sous-titrage pour la traduction (<i lang="en">subtitles</i>) et le sous-titrage pour sourds et malentendants (<i lang="en">close captions</i>). Ces deux types de sous-titrage poursuivent des buts diff&#233;rents. Dans le cadre du RGAA 3.0, les sous-titres doivent &#234;tre dans la langue du m&#233;dia concern&#233;. Si la vid&#233;o est en anglais par exemple, les sous-titres doivent &#234;tre en anglais.</p>
			<p>Les sous-titres ne concernent que les vid&#233;os. Ils doivent reprendre toutes les informations de la vid&#233;o&#160;: les dialogues de personnages, la voix-off ou m&#234;me un bruit qui donne un sens et qui permet de comprendre une action.</p>
			<p>Ils doivent &#234;tres correctement synchronis&#233;s et ils doivent &#234;tre activables et d&#233;sactivables depuis le lecteur. Si le lecteur ne propose pas cette fonctionnalit&#233;, alors il est possible de mettre 2 vid&#233;os &#224; disposition&#160;: une vid&#233;o sans les sous-titres et une vid&#233;o avec les sous-titres. Chacune peut &#234;tre plac&#233;e sur une page diff&#233;rente, l'important est que l'utilisateur comprenne ais&#233;ment qu'il existe une version avec les sous-titres. Le plus simple sera alors de cr&#233;er un lien avant la vid&#233;o sans les sous-titres qui m&#232;ne vers la vid&#233;o avec les sous-titres et au-dessus de la vid&#233;o avec les sous-titres, cr&#233;er un lien qui ram&#232;ne vers la vid&#233;o sans les sous-titres.</p>
			<p>Ci dessous, un exemple de vid&#233;o avec des sous-titres. <a href="http://www.accessibilite.sncf.com/actualites/a-la-une/article/video-sncf-24-24-sur-acces-plus">Retrouvez cet exemple sur le site de la d&#233;l&#233;gation &#224; l&#8217;accessibilit&#233; et aux voyageurs handicap&#233;s de SNCF</a>.</p>
			<img src="img/multimedia/sous-titres.png" alt="">
		</article>
		<article class="article">
			<h4 id="transcription-textuelle">Transcription textuelle</h4>
			<p>La transcription textuelle concerne les vid&#233;os et les fichiers audios seuls.</p>
			<p>Une transcription textuelle est la retranscription en texte de tous les contenus audibles et informatifs de la vid&#233;o. Elle reprend&#160;:</p>
			<ul>
			<li>la totalit&#233; de ce qui y est exprim&#233; oralement ;</li>
			<li>toutes les informations descriptives n&#233;cessaires &#224; une compr&#233;hension &#233;quivalente de l'action.</li>
			</ul>
			<p>Ces informations textuelles doivent &#234;tre pr&#233;sent&#233;es dans l'ordre chronologique de leur apparition dans la vid&#233;o.</p>
			<p>Une transcription textuelle est un contenu texte structur&#233;, comme tout autre contenu texte. Selon les besoins, n'h&#233;sitez pas &#224; utiliser les listes, les titres, etc.</p>
			<p>La mise &#224; disposition pour les utilisateurs de cette transcription textuelle peut se faire de plusieurs mani&#232;res&#160;:</p>
			<ul>
			<li>elle peut &#234;tre situ&#233;e juste en dessous de la vid&#233;o elle-m&#234;me, en pr&#233;cisant de quoi il s'agit. Le mieux &#233;tant de titrer &#233;galement cette vid&#233;o&#160;;</li>
			<li>elle peut &#233;galement &#234;tre situ&#233;e dans une autre page que celle de la vid&#233;o. Il suffit alors de placer un lien sous la vid&#233;o qui m&#232;ne vers cette page.</li>
			</ul>
			<p>Ci-dessous, un exemple de transcription textuelle situ&#233;e directement sous la vid&#233;o (<a href="http://www.fiphfp.fr/Temoignages/Temoignages-d-agents/Lionel-Scarlatti">Retrouvez cet exemple sur le site du FIPHFP</a>).</p>
			<img src="img/multimedia/transcription-textuelle.jpeg" alt="" />
		</article>
		<article class="article">
			<h4 id="audiodescription">Audiodescription</h4>
			<p>L'audiodescription ne concerne que les vid&#233;os.</p>
			<p>Une audiodescription est une narration ajout&#233;e &#224; la piste sonore de la vid&#233;o pour d&#233;crire les d&#233;tails visuels importants qui ne peuvent &#234;tre compris &#224; partir de la piste sonore principale seulement.</p>
			<p>L'audiodescription d'une vid&#233;o fournit de l'information &#224; propos des actions, des personnages, des changements de sc&#232;nes, du texte apparaissant &#224; l'&#233;cran et d'autres contenus visuels.</p>
			<p>Lorsque toute l'information de la vid&#233;o est d&#233;j&#224; donn&#233;e dans la piste audio, aucune audiodescription suppl&#233;mentaire n'est requise. Par exemple, dans le cadre d'une interview, il est facile d'&#233;viter le besoin d'audiodescription en annon&#231;ant le nom et la fonction des interlocuteurs, qui sont souvent repris en cartouche visuellement. Si ce besoin de description sonore est anticip&#233;, l'audiodescription peut devenir superflue. Prendre en compte ce besoin en conception est moins co&#251;teux, alors pensez-y !</p>
			<p>L'audiodescription doit &#234;tre synchronis&#233;e avec la vid&#233;o, et comme les sous-titres, elle doit pouvoir &#234;tre activ&#233;e et d&#233;sactiv&#233;e.</p>
		</article>
		<article class="article">
			<h4 id="volume-des-dialogues">Volume des dialogues</h4>
			<p>Dans le cas de fichiers sons seuls, vous devez veiller &#224; ce que les dialogues soient suffisamment audibles. Plusieurs solutions sont possibles si ce n'est pas le cas&#160;:</p>
			<ul>
			<li>votre lecteur permet de d&#233;sactiver l'arri&#232;re-plan sonore&#160;;</li>
			<li>il existe une version alternative sans l'arri&#232;re-plan sonore ou avec un volume des dialogues plus &#233;lev&#233;s.</li>
			</ul>
		</article>
		<article class="article">
			<h4 id="pas-de-lancement-automatique">Pas de lancement automatique</h4>
			<p>Vous devez &#233;viter au maximum de lancer les contenus multim&#233;dias qui comportent du son automatiquement au chargement de la page. Ces param&#232;tres existent souvent pour les vid&#233;os que l'on int&#232;gre, et m&#234;me s'il est possible de d&#233;sactiver le son, il est pr&#233;f&#233;rable de ne pas rendre la lecture automatique.</p>
		</article>
		<article class="article">
			<h3 id="contenus-multim&#233;dia-hors-vid&#233;os-et-fichiers-sons">Contenus multim&#233;dia (hors vid&#233;os et fichiers sons)</h3>
			<p>En dehors des vid&#233;os et fichiers sons, on parle de contenu multim&#233;dia non temporel. Il s'agit d'animation ou d'activit&#233; interactive r&#233;alis&#233;e &#224; l'aide d'une technologie qui n&#233;cessite une extension. La plus embl&#233;matique est la technologie Flash.</p>
			<p><a href="http://www.ccdmd.qc.ca/fr/exercices_interactifs/index.cgi?id=1028&amp;action=animer">Voir un exemple d'activit&#233; interactive en Flash sur le site du Centre coll&#233;gial de d&#233;veloppement de mat&#233;riel didactique</a></p>
			<img src="img/multimedia/non-temporel.png" alt="" />
			<p>Pour ce type de contenu, vous devez vous assurer qu'un utilisateur qui ne peut pas utiliser de souris et qui navigue uniquement &#224; l'aide du clavier puisse r&#233;aliser les m&#234;mes actions.</p>
			<p>S'il n'est pas possible de rendre cet objet accessible, vous devez fournir une alternative accessible. Dans ce genre de cas, la solution peut &#234;tre tr&#232;s technique, il est pr&#233;f&#233;rable de vous rapprocher du service informatique.</p>
		</article>
		<article class="article">
			<h3 id="accessibilit&#233;-des-interfaces-des-contenus-multim&#233;dia">Accessibilit&#233; des interfaces des contenus multim&#233;dia</h3>
			<p>Bien que vous ne soyez pas en capacit&#233; d'&#233;valuer compl&#232;tement l'accessibilit&#233; des lecteurs audio ou vid&#233;o ou d'autres objets multim&#233;dia, vous pouvez au moins r&#233;aliser deux op&#233;rations de contr&#244;le.</p>
			<h4 id="pr&#233;sence-des-contr&#244;les-minimums">Pr&#233;sence des contr&#244;les minimums</h4>
			<p>Un lecteur audio ou vid&#233;o doit poss&#233;der au minimum 5 contr&#244;les&#160;:</p>
			<ul>
			<li>un bouton de lecture et de pause&#160;;</li>
			<li>un bouton d'arr&#234;t&#160;;</li>
			<li>un &#233;l&#233;ment de contr&#244;le du son, qui permet de couper et relancer le son&#160;;</li>
			<li>un bouton d'activation et de d&#233;sactivation des sous-titres (si pr&#233;sents)&#160;;</li>
			<li>un bouton d'activation et de d&#233;sactivation de l'audiodescription (si pr&#233;sente).</li>
			</ul>
			<h4 id="utilisation-au-clavier-et-&#224;-la-souris">Utilisation au clavier et &#224; la souris</h4>
			<p>Tout objet multim&#233;dia (qu'il comporte ou non de la vid&#233;o et du son) doit &#234;tre utilisable au clavier et &#224; la souris. Vous pouvez tester son accessibilit&#233; au clavier en utilisant la touche tabulation de votre clavier. De cette mani&#232;re, assurez-vous que vous acc&#233;dez &#224; toutes les fonctionnalit&#233;s de l'objet. Si c'est une vid&#233;o par exemple, assurez-vous que les boutons de lecture, de pause, etc. sont accessibles uniquement en utilisant la touche tabulation et qu'ils sont activables.</p>
		</article>
		<article class="article">
			<h2 id="m&#233;mo-pour-agir">M&#233;mo pour agir</h2>
			<ul>
			<li>Peut-on comprendre cette vid&#233;o sans le son&#160;?</li>
			<li>Peut-on comprendre cette vid&#233;o sans la voir (juste en l'&#233;coutant)&#160;?</li>
			<li>Est-ce que mon fichier son ou ma vid&#233;o poss&#232;de une transcription textuelle ?</li>
			<li>Puis-je arr&#234;ter et relancer la vid&#233;o simplement en utilisant la touche tabulation ?</li>
			</ul>
		</article>
		<article class="article">
			<h2 id="id&#233;es-re&#231;ues">Id&#233;es re&#231;ues</h2>
			<h3 id="pensez-&#224;-la-langue-des-signes-lsf">Pensez &#224; la langue des signes (LSF)</h3>
			<p>Les sous-titres ne sont pas forc&#233;ment une alternative suffisante pour les personnes malentendantes. En effet, certaines personnes sourdes ou malentendantes ne lisent et ne comprennent que la langue des signes. C'est pourquoi une transcription textuelle n'est pas forc&#233;ment une alternative suffisante.</p>
		</article>
	</main>
	<aside role="complementary"  id="footer-block" class="clear">
		<div class="col-1-2">
			<h2 id="voir-aussi...">Voir aussi...</h2>
			<ul>
			<li>Donner un titre &#224; vos contenus multim&#233;dias. Voir la <a href="titres.html">fiche 7&#160;: Les titres, ou le plan de la page</a></li>
			<li>Cr&#233;er des liens pertinents pour renvoyer vers les alternatives des fichiers multim&#233;dias. Voir la <a href="liens.html">fiche 6&#160;: Cr&#233;er du lien sans perdre son chemin</a></li>
			</ul>
			<h2 id="voir-ailleurs...">Voir ailleurs...</h2>
			<ul>
			<li><a href="http://www.fiphfp.fr/Temoignages/Temoignages-d-agents">Des exemples de vid&#233;os accessibles sur le site du FIPHFP</a></li>
			<li><a href="http://ics.utc.fr/capa/DOCS/SP4/Tuto/02/co/02-CAPA_BonnesPratiques_6.html">Bonnes pratiques pour l'accessibilit&#233; des vid&#233;os (Sur le site de l'Unit&#233; ing&#233;nierie des contenus et savoirs)</a></li>
			<li><a href="http://ics.utc.fr/capa/DOCS/SP4/Tuto/02/co/02-CAPA_BonnesPratiques_11.html">Bonnes pratiques pour l'accessibilit&#233; des fichiers sons (Sur le site de l'Unit&#233; ing&#233;nierie des contenus et savoirs)</a></li>
			</ul>
			<article class="article">	
				<h2 id="note-concernant-les-niveaux-de-conformit&#233;">Note concernant les niveaux de conformit&#233;</h2>
				<p>Selon le niveau de conformit&#233; au RGAA 3.0, les recommandations en termes d'accessibilit&#233; ne sont pas les m&#234;mes pour les &#233;l&#233;ments multim&#233;dias de type vid&#233;o ou audio. Ci-dessous nous r&#233;sumons bri&#232;vement les exigences concernant cette probl&#233;matique. Ce r&#233;sum&#233; ne remplace pas les recommandations &#233;nonc&#233;es dans le r&#233;f&#233;rentiel, auquel nous vous renvoyons pour plus de d&#233;tails&#160;: <a href="http://references.modernisation.gouv.fr/referentiel-technique-0#title-124-multimdia">crit&#232;res de la th&#233;matique multim&#233;dia du RGAA 3.0</a>.</p>
				<ul>
				<li>Niveau A&#160;:
				<ul>
				<li>une transcription textuelle ou une audiodescription&#160;;</li>
				<li>des sous-titres synchronis&#233;s.</li>
				</ul></li>
				<li>Niveau AA&#160;:
				<ul>
				<li>une transcription textuelle&#160;;</li>
				<li>des sous-titres synchronis&#233;s&#160;;</li>
				<li>une audiodescription synchronis&#233;e.</li>
				</ul></li>
				<li>Niveau AAA&#160;:
				<ul>
				<li>une transcription textuelle&#160;;</li>
				<li>des sous-titres synchronis&#233;s&#160;;</li>
				<li>une audiodescription&#160;;</li>
				<li>une audiodescription &#233;tendue synchronis&#233;e&#160;;</li>
				<li>une interpr&#233;tation en langue des signes.</li>
				</ul></li>
				</ul>
			</article>
		</div>
		<div class="col-1-2">
			<h2 id="correspondances-rgaa-3.0">Correspondances RGAA 3.0</h2>
			<ul>
				<li>Crit&#232;re 4.1 [A]</li>
				<li>Crit&#232;re 4.2 [A]</li>
				<li>Crit&#232;re 4.3 [A]</li>
				<li>Crit&#232;re 4.4 [A]</li>
				<li>Crit&#232;re 4.5 [AA]</li>
				<li>Crit&#232;re 4.6 [AA]</li>
				<li>Crit&#232;re 4.7 [AA]</li>
				<li>Crit&#232;re 4.8 [AA]</li>
				<li>Crit&#232;re 4.9 [AAA]</li>
				<li>Crit&#232;re 4.10 [AAA]</li>
				<li>Crit&#232;re 4.11 [AAA]</li>
				<li>Crit&#232;re 4.12 [AAA]</li>
				<li>Crit&#232;re 4.13 [AAA]</li>
				<li>Crit&#232;re 4.14 [AAA]</li>
				<li>Crit&#232;re 4.16 [A]</li>
				<li>Crit&#232;re 4.17 [A]</li>
				<li>Crit&#232;re 4.18 [A]</li>
				<li>Crit&#232;re 4.19 [AAA]</li>
			</ul>
			
		</div>
	</aside>
	<footer id="footer" role="contentinfo" class="clear">
		<h2>Licence d'utilisation</h2>
		<p class="logo-smgap"><a href="http://references.modernisation.gouv.fr/"><img src="img/modernisation-logo.jpg" alt="Secrétariat général pour le modernisation de l'action publique"></a></p>
		<p>Ce document est la propri&#233;t&#233; du Secr&#233;tariat g&#233;n&#233;ral &#224; la modernisation de l'action publique fran&#231;ais (SGMAP). Il est plac&#233; sous la <a href="https://www.etalab.gouv.fr/licence-ouverte-open-licence">licence ouverte 1.0 ou ult&#233;rieure</a>, &#233;quivalente &#224; une licence <i lang="en">Creative Commons BY</i>. Pour indiquer la paternit&#233;, ajouter un lien vers la version originale du document disponible sur le <a href="https://github.com/DISIC">compte <span lang="en">GitHub</span> de la DInSIC</a>.</p>
		
	</footer>

</div>
<script type="text/javascript" src="js/script.js"></script>
</body>
</html>
