<!DOCTYPE html>
<html lang="fr">
<head>
  <meta charset="utf-8">
  <meta name="generator" content="pandoc">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
  <title>Fiche 7&nbsp;: Les titres, ou le plan de la page</title>

  <!--[if lt IE 9]>
    <script src="http://html5shim.googlecode.com/svn/trunk/html5.js"></script>
  <![endif]-->
  <link rel="stylesheet" href="css/styles.css" media="all">
  <link rel="stylesheet" href="css/print.css" media="print">
</head>
<body>
<div class="main-header">
	<div class="inside">
		<ul class="skip-links">
			<li><a href="#main">contenu</a></li>
			<li><a href="#navigation">navigation</a></li>
		</ul>
		<header role="banner" class="header  clear" id="banner">
			<h1 class="title">Guide &#171;&#160;Contribuer sur le Web de mani&#232;re accessible&#160;&#187;</h1>
		</header>

		<nav role="navigation" class="gp-sommaire" id="navigation" aria-label="Sommaire du guide">
			<button id="btnSommaire" aria-expanded="false">Sommaire</button>
			<ul class="sommaire is-hidden" id="sommaireToggle">
				<li><a href="index.html">Introduction</a></li>
				<li><a href="images.html">Fiche 1&nbsp;: Quand une image vaut mille mots</a></li>
				<li><a href="couleurs.html">Fiche 2&nbsp;: Les couleurs</a></li>
				<li><a href="cadres.html">Fiche 3&nbsp;: Embarquer des contenus d'autres sites sur ses pages</a></li>
				<li><a href="multimedia.html">Fiche 4&nbsp;: Du multim&#233;dia pour tous et toutes</a></li>
				<li><a href="tableaux.html">Fiche 5&nbsp;: Des tableaux pour pr&#233;senter des donn&#233;es, <i lang="en">what else?</i></a></li>
				<li><a href="liens.html">Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</a></li>
				<li><a href="titres.html">Fiche 7&nbsp;: Les titres, ou le plan de la page</a></li>
				<li><a href="listes.html">Fiche 8&nbsp;: Listes &#224; puces et listes num&#233;rot&#233;es</a></li>
				<li><a href="langue.html">Fiche 9&nbsp;: Textes multilingues</a></li>
				<li><a href="citations.html">Fiche 10&nbsp;: Citations</a></li>
				<li><a href="mise-en-forme.html">Fiche 11&nbsp;: Mise en forme des textes</a></li>
				<li><a href="docs_telechargement.html">Fiche 12&nbsp;: Documents en t&#233;l&#233;chargement</a></li>
				<li><a href="definition.html">Fiche 13&nbsp;: Abr&#233;viations, mots complexes et glossaire</a></li>
				<li><a href="glossaire.html">Glossaire</a></li>
			</ul>
		</nav>
		<div class="github-link">
			<p><a title="Contribuer sur Github" href="https://github.com/DISIC/guide-contribuer_accessible">Contribuer</a>
			<a class="pdfdown" title="Télécharger le guide Contribuer sur le web de manière accessible (pdf, 46ko)" href="http://references.modernisation.gouv.fr/sites/default/files/guide-contribuer-accessible-3.pdf" rel="download">Télécharger</a></p>
		</div>
	</div>
</div>

<div id="wrapper">
	
	<nav role="navigation" class="internav clear">
		<ul>
			<li><a class="prev" href="liens.html"><span aria-hidden="true"> &laquo; </span> Fiche 6&nbsp;: Cr&#233;er du lien sans perdre son chemin</a></li>
			<li><a class="next" href="listes.html">Fiche 8&nbsp;: Listes &#224; puces et listes num&#233;rot&#233;es <span aria-hidden="true"> &raquo; </span></a></li>
		</ul>
	</nav>	
	<main id="main" role="main">
		<h1 class="fiche-title">Fiche 7&nbsp;: Les titres, ou le plan de la page</h1>
		<article class="article">
			<h2 id="lenjeu-pour-lutilisateur-handicap&#233;">L'enjeu pour l'utilisateur handicap&#233;</h2>
			<p>Utiliser des titres et des sous-titres permet de structurer votre texte en parties et fournit &#224; l'utilisateur un plan du document et lui permet de naviguer de titre en titre pour se d&#233;placer plus rapidement dans le contenu de la page.</p>
			<p>Pour des personnes ayant des d&#233;ficiences cognitives, les titres permettent de mieux appr&#233;hender le contenu de la page et d'en saisir plus ais&#233;ment l'articulation logique.</p>
			<p>Pour les utilisateurs ayant un handicap moteur et ne naviguant qu'au clavier, les titres sont autant de jalons qu'ils peuvent utiliser pour naviguer plus rapidement dans une page.</p>
			<p>Pour un utilisateur d&#233;ficient visuel (aveugle ou malvoyant), un contenu web est une longue suite de texte. S'il utilise un <a href="glossaire.html#lecteur-decran">lecteur d'&#233;cran</a>, il dispose de raccourcis claviers pour naviguer entre les types d'&#233;l&#233;ments (titre, champ de formulaire, liste, etc.). Sans structure et sans la possibilit&#233; d'appr&#233;hender la mise en forme (le gras, la taille des caract&#232;res), il lui est difficile de se rep&#233;rer.</p>
		</article>
		<article class="article">
			<h2 id="en-pratique-et-en-images">En pratique et en images</h2>
			<p>Tout contenu &#233;ditorial doit poss&#233;der au moins un titre qui l'introduit. De pr&#233;f&#233;rence, il faut cr&#233;er des sections relativement courtes et titr&#233;es.</p>
			<p>Titrer ne suffit pas, il est important de respecter la hi&#233;rarchie des titres. Si vous d&#233;marrez votre contenu par un titre de niveau 1 et que vous cr&#233;ez une sous-partie, le titre de cette sous-partie devra &#234;tre de niveau 2 et ainsi de suite jusqu'au niveau 6 (dernier niveau de titre disponible). &#192; noter que le nombre de titres dans une page n'est pas limit&#233;.</p>
			<p><strong>Attention :</strong> la structure globale des pages de votre site a parfois un ou des titres g&#233;n&#233;r&#233;s automatiquement. Il est fr&#233;quent que le titre de la page soit g&#233;n&#233;r&#233; automatiquement avec un titre de niveau 1. D&#233;marrer alors votre contenu avec un titre de niveau 2, puisque votre contenu d&#233;pend de ce titre principal. <strong>Demandez au d&#233;veloppeur de votre site &#224; partir de quel niveau de titre vous devez d&#233;marrer vos contenus.</strong></p>
			<p>Dans la plupart des &#233;diteurs de texte, vous pouvez d&#233;finir des titres &#224; l'aide d'une liste d&#233;roulante qui contient toutes sortes de styles. Les titres sont d&#233;sign&#233;s par &#171;&#160;Titre 1&#160;&#187;, &#171;&#160;Titre 2&#160;&#187; ou parfois en anglais &#171;&#160;<i lang="en">Heading 1</i>&#160;&#187;...</p>
			<p>Ci-dessous un exemple de d&#233;finition d'un titre dans l'&#233;diteur de texte <span lang="en">CKEditor</span>.</p>
			<img src="img/titres/ckeditor.png" alt="" />
			<p>Pour d&#233;finir un titre, vous devez&#160;:</p>
			<ul>
			<li>Surligner le texte que vous souhaitez transformer en titre.</li>
			<li>Cliquer sur &#171; Normal &#187; (parfois c'est une simple liste d&#233;roulante qui est &#224; disposition).</li>
			<li>Choisir le niveau de titre voulu.</li>
			</ul>
			<p>Vous ne devez pas utiliser des titres sur des &#233;l&#233;ments textes qui n'en sont pas pour une question de mise en forme.</p>
		</article>
		<article class="article">
			<h3 id="headings-map-un-outil-pour-v&#233;rifier-le-plan-du-document"><i lang="en">HeadingsMap</i> : un outil pour v&#233;rifier le plan du document</h3>
			<p>L'extension <span lang="en">Firefox</span>, <a href="https://addons.mozilla.org/fr/firefox/addon/headingsmap/"><span lang="en">HeadingsMap</span></a>, vous permet d'un coup d'oeil de rep&#233;rer les erreurs de titrage dans votre contenu. Pour vous aider, vous pouvez consulter l'<a href="https://support.mozilla.org/fr/kb/trouver-installer-modules-firefox">aide sur l'installation d'extension sur <span lang="en">Firefox</span></a>.</p>
			<p>Une fois l'extension install&#233;e, placez-vous sur la page dont vous souhaitez tester les titres, faites clic droit et s&#233;lectionnez <span lang="en">HeadingsMap</span>. Un volet s'ouvre sur la gauche de la page. Placez-vous sur l'onglet <i lang="en">Headings</i>. Vous avez alors une vision rapide de votre hi&#233;rarchie : l'imbrication des diff&#233;rentes parties et les niveaux de titres. Si une erreur est d&#233;tect&#233;e, elle est surlign&#233;e en rouge.</p>
			<p>Dans l'exemple ci-dessous, la structure de gauche est correcte. La structure de droite quant &#224; elle contient plusieurs erreurs. Toute la hi&#233;rarchie est surlign&#233;e en rouge. En effet, on constate que le plan d&#233;marre avec un titre de niveau 2 et qu'il manque un titre de niveau 1 pour avoir une hi&#233;rarchie coh&#233;rente.</p>
			<img src="img/titres/headingsmap.png" alt="" />
		</article>
		<article class="article">
			<h2 id="m&#233;mo-pour-agir">M&#233;mo pour agir</h2>
			<ul>
			<li>J'ai mis ce texte en gras. Est-ce que &#231;a ne devrait pas plut&#244;t &#234;tre un titre ?</li>
			<li>J'ai un texte tr&#232;s long. Ne serait-il pas possible de le diviser en sous-parties et leur donner &#224; chacune un titre ?</li>
			</ul>
		</article>
	</main>

	<aside role="complementary" id="footer-block" class="clear">
		<div class="col-1-2">
		&nbsp;
		</div>

		<div class="col-1-2">
			<h2 id="correspondances-rgaa-3.0">Correspondances RGAA 3.0</h2>
			<ul>
			<li>Crit&#232;re 9.1 [A]</li>
			</ul>
		</div>
	</aside>
	
	
	<footer id="footer" role="contentinfo" class="clear">
		<h2>Licence d'utilisation</h2>
		<p class="logo-smgap"><a href="http://references.modernisation.gouv.fr/"><img src="img/modernisation-logo.jpg" alt="Secrétariat général pour le modernisation de l'action publique"></a></p>
		<p>Ce document est la propri&#233;t&#233; du Secr&#233;tariat g&#233;n&#233;ral &#224; la modernisation de l'action publique fran&#231;ais (SGMAP). Il est plac&#233; sous la <a href="https://www.etalab.gouv.fr/licence-ouverte-open-licence">licence ouverte 1.0 ou ult&#233;rieure</a>, &#233;quivalente &#224; une licence <i lang="en">Creative Commons BY</i>. Pour indiquer la paternit&#233;, ajouter un lien vers la version originale du document disponible sur le <a href="https://github.com/DISIC">compte <span lang="en">GitHub</span> de la DInSIC</a>.</p>
		
	</footer>

</div>
<script type="text/javascript" src="js/script.js"></script>
</body>
</html>
